Repository: KDE/ktechlab
Catalog: po/*/ktechlab.po
Languages: ar, ka

source: PIC&16 Specific
ar: خاص بـ PIC&16
ka: PIC&16-ის სპეციფიკური

source: Do not use default libraries (--nodefaultlibs)
ar: لا تستخدم المكتبات المبدئية (--nodefaultlibs)
ka: ნაგულისხმევი ბიბლიოთეკები გამოყენებული არ იქნება (--nodefaultlibs)

source: Do not generate BANKSEL directives (--pno-banksel)
ar: لا تولّد توجيهات BANKSEL (--pno-banksel)
ka: არ მოხდება BANSKEL-ის დირექტივების გენერაცია (--pno-banksel)

source: Use large stac&k model (--pstack-model=large)
ar: استخدم نموذج المكدس الكب&ير (--pstack-model=large)
ka: დიდი სტე&კის მოდელის გამოყენება (--pstack-model=large)

source: Show more debug info in assembl&y output (--debug-xtra)
ar: اعرض المزيد من معلومات التصحيح في مخرج التجمي&ع (--debug-xtra)
ka: მეტი გამართვის ინფორმა&ციის ჩვენება ასამბლერის გამოტანაში (--debug-xtra)

source: E&xplicit enable of peepholes (--denable-peeps)
ar: تفعيل &صريح لثقوب النظر (--denable-peeps)
ka: პირდაპირი წვდომის წერტილების აშ&კარა ჩართვა (--denable-peeps)

source: Du&mp call tree in .calltree file (--calltree)
ar: فرّغ شج&رة الاستدعاء في ملف .calltree (--calltree)
ka: გამოძა&ხებების ხის დამპი ფაილში .calltree (--calltree)

source: Ena&ble stack optimizations (--fstack)
ar: ف&عّل تحسينات المكدس (--fstack)
ka: სტეკის ოპტიმიზაციე&ბის ჩართვა (--fstack)

source: Try to use conditional BRA instead of GOTO (--optimi&ze-goto)
ar: حاوِل استخدام BRA شرطي بدلًا من GOTO (--حسّن-القفز&)
ka: პირობის მქონე BRA-ის გამოყენების ცდა GOTO-ის მაგიერ (--optimi&ze-goto)

source: Try to optimize some compares (--optimize-cmp)
ar: حاوِل تحسين بعض المقارنات (--optimize-cmp)
ka: ზოგიერთი შედარების ოპტიმიზაციის ცდა (--optimize-cmp)

source: Thorough data flow analysis (resource intensive) (--optimize-df)
ar: تحليل شامل لتدفق البيانات (مكثف للموارد) (--optimize-df)
ka: მონაცემთა ნაკადის საფუძვლიანი ანალიზი (იხარჯება დიდი რესურსი) (--optimize-df)

source: SDCC install prefix:
ar: بادئة تثبيت SDCC:
ka: SDCC-ის დაყენების პრეფიქსი:

source: Location where SDCC in installed. Empty for system default.
ar: الموقع حيث ثُبِّت SDCC. اترك فارغًا للمبدئي للنظام.
ka: ადგილი, სადაც SDCC-ია დაყენებული. ცარიელია სისტემის ნაგულისხმევისთვის.

source: General
ar: عامّ
ka: ძირითადი

source: General Options
ar: خيارات عامة
ka: ზოგადი პარამეტრები

source: Programmer
ar: المبرمج
ka: პროგრამისტი

source: Formatter
ar: المنسِّق
ka: დამფორმატებელი

source: Assembly Formatter
ar: منسق التجميع
ka: ასამბლერის დამფორმატებელი

source: Electronic Logic Values
ar: قيم المنطق الإلكتروني
ka: ელექტრონული ლოგიკის მნიშვნელობები

source: Lowest (%1 FPS)
ar: الأدنى (%1 إطار/ثانية)
ka: უმდაბლესი (%1 კადრ/წმ)

source: Low (%1 FPS)
ar: منخفض (%1 إطار/ثانية)
ka: დაბალი (%1 კადრ/წმ)

source: Medium (%1 FPS)
ar: متوسط (%1 إطار/ثانية)
ka: საშუალო (%1 კადრ/წმ)

source: High (%1 FPS)
ar: عالي (%1 إطار/ثانية)
ka: მაღალი (%1 კადრ/წმ)

source: Highest (%1 FPS)
ar: الأعلى (%1 إطار/ثانية)
ka: უმაღლესი (%1 კადრ/წმ)

source: Unknown value
ar: قيمة مجهولة
ka: უცნობი მნიშვნელობა

source: <b>%1</b> cannot be found.<br>
ar: لا &يمكن إيجاد <b>%1</b>.<br>
ka: <b>%1</b> ვერ ვიპოვე.<br>

source: <b>%1</b> found: %2<br>
ar: <b>%1</b> موجد: %2<br>
ka: <b>%1</b> ნაპოვნია: %2<br>

source: Remove programmer configuration "%1"?
ar: أزِل تشكيلة المبرمج "%1"؟
ka: წავშალო პროგრამატორის კონფიგურაცია "%1"?

source: Remove "%1"
ar: أزل "%1"
ka: "%1"-ის წაშლა

source: Configuration Name
ar: اسم التشكيلة
ka: კონფიგურაციის სახელი

source: Value radix:
ar: أساس القيمة:
ka: მნიშვნელობის ფესვი:

source: Automatic
ar: آليّ
ka: ავტომატური

source: Manual
ar: يدويّ
ka: ხელით

source: Connection Routing Mode
ar: وضع توجيه الاتصال
ka: კავშირის რაუტინგის რეჟიმი

source: <b>Manual</b> connection routing enabled.
ar: فُعِّل توجيه الاتصال <b>اليدوي</b>.
ka: <b>ხელით</b> დაკავშირების რაუტინგი ჩართულია.

source: <b>Automatic</b> connection routing enabled.
ar: فُعِّل توجيه الاتصال <b>الآلي</b>.
ka: <b>ავტომატური</b> დაკავშირების რაუტინგი ჩართულია.

source: Alignment
ar: محاذاة
ka: სწორება

source: SVG export is sub-functional
ar: تصدير SVG شبه وظيفي
ka: SVG-ში გატანის ფუნქციონალი სრული არაა

source: There is nothing to crop
ar: لا يوجد شيء للقص
ka: ამოსაჭრელი არაფერია

source: Export failed
ar: فشل التصدير
ka: გატანის შეცდომა

source: Image Export
ar: تصدير الصورة
ka: გამოსახულების გატანა

source: Could not open %1 for reading
ar: تعذر فتح %1 للقراءة
ka: %1-ის წასაკითხად გახსნის შეცდომა

source: Could not parse XML: %1
ar: لا يمكن تحليل XML: %1
ka: ვერ დავამუშავე XML: %1

source: Could not open '%1' for writing. Check that you have write permissions
ar: لا يمكن فتح '%1' للكتابة. تحقق من امتلاكك أذونات الكتابة
ka: '%1'-ის ჩასაწერად გახსნა შეუძლებელია. შეამოწმეთ, გაქვთ თუ არა ჩაწერის უფლება

source: Saving File
ar: يحفظ الملفّ
ka: მიმდინარეობს ფაილის შენახვა

source: This help item does not yet exist for the %1 language. Help out with KTechlab by creating one via the "Edit" button.
ar: عنصر المساعدة هذا لا يوجد بعد للغة %1. ساعد KTechlab بإنشاء واحد عبر زر "حرّر".
ka: ეს დახმარების ელემენტი ჯერ არ არსებობს %1 ენისთვის. დაგეხმარეთ KTechlab-ს ახლის შექმნით "ჩასწორების" ღილაკის საშუალებით.

source: Could not open item descriptions file "%1" for writing.
ar: لا يمكن فتح ملف أوصاف العنصر "%1" للكتابة.
ka: ჩაწერისთვის ვერ გავხსენი ელემენტის აღწერების ფაილი "%1".

source: Cancel
ar: ألغِ
ka: გაუქმება

source: Delete
ar: احذف
ka: წაშლა

source: Export as Image...
ar: صدِّر كصورة...
ka: გამოსახულების სახით გატანა...

source: Align Horizontally
ar: حاذِ أفقيًا
ka: ჰორიზონტალურად სწორება

source: Align Vertically
ar: حاذِ عموديًا
ka: ვერტიკალურად სწორება

source: Distribute Horizontally
ar: وزّع أفقيًا
ka: განაწილება ჰორიზონტალურად

source: Distribute Vertically
ar: وزّع عموديًا
ka: განაწილება ვერტიკალურად

source: Draw
ar: ارسم
ka: ხატვა

source: Raise Selection
ar: ارفع التحديد
ka: მონიშნულის ამოწევა

source: Lower Selection
ar: اخفض التحديد
ka: მონიშნულის დაწევა

source: Left click to add. Right click to resume normal editing
ar: انقر باليسار للإضافة. انقر باليمين لاستئناف التحرير العادي
ka: მარცხენა წკაპი დასამატებლად. მარჯვენა წკაპი ნორმალური ჩასწორების გასაგრძელებლად

source: Click and hold to start drawing.
ar: انقر واستمر بالنقر لبدء الرسم.
ka: დააწკაპუნეთ და გეჭიროთ ხატვის დასაწყებად.

source: Right click to cancel the connector
ar: انقر باليمين لإلغاء الموصل
ka: მარჯვენა წკაპი კონექტორის გასაუქმებლად

source: Behavior
ar: السّلوك
ka: ქცევა

source: Make Non-Persistent
ar: اجعل غير مستمر
ka: არამუდმივად გარდაქმნა

source: Make Persistent
ar: اجعل مستمرًا
ka: მუდმივად გარდაქმნა

source: Move To
ar: انقل إلى
ka: გადატანა

source: Left Sidebar
ar: الشّريط الجانبيّ الأيمن
ka: მარცხენა პანელი

source: Right Sidebar
ar: الشّريط الجانبيّ الأيسر
ka: მარჯვენა პანელი

source: Top Sidebar
ar: الشّريط الجانبيّ العلويّ
ka: ზედა პანელი

source: Bottom Sidebar
ar: الشّريط الجانبيّ السفليّ
ka: ქვედა პანელი

source: Project
ar: المشروع
ka: პროექტი

source: Components
ar: المكوّنات
ka: კომპონენტები

source: Flow Parts
ar: أجزاء التدفق
ka: დიაგრამის ნაწილები

source: Mechanics
ar: ميكانيكا
ka: მექანიკა

source: Item Editor
ar: محرر العناصر
ka: ელემენტის რედაქტორი

source: Context Help
ar: مساعدة سياقيّة
ka: კონტექსტური დახმარება

source: Messages
ar: الرسائل
ka: შეტყობინებები

source: Symbol Viewer
ar: عارض الرّموز
ka: სიმბოლოს ნახვა

source: Scope Screen (Very Rough)
ar: شاشة النطاق (تقريبية جدًا)
ka: საერთო ეკრანი (ძალიან უხეში)

source: &New
ar: &جديد
ka: &ახალი

source: C source
ar: مصدر C
ka: C-ის საწყისი კოდი

source: New Project...
ar: مشروع جديد...
ka: ახალი პროექტი...

source: Open Project...
ar: افتح مشروعًا
ka: პროექტის გახსნა...

source: Open &Recent Project...
ar: افتح مشروعًا &حديثًا...
ka: ახლახანს გახსნილი პ&როექტის გახსნა...

source: Export to Makefile...
ar: صدّر إلى Makefile...
ka: გატანა Makefile-ში...

source: Create Subproject...
ar: أنشئ مشروعًا فرعيًا...
ka: ქვეპროექტის შექმნა...

source: Add Existing File...
ar: أضف ملفًا موجودًا...
ka: არსებული ფაილის დამატება...

source: Add Current File...
ar: أضف الملف الحالي...
ka: მიმდინარე ფაილის დამატება...

source: Close Project
ar: أغلق المشروع
ka: პროექტის დახურვა

source: Remove from Project
ar: أزل من المشروع
ka: პროექტიდან წაშლა

source: Insert Existing File...
ar: أدرج ملفًا موجودًا...
ka: არსებული ფაილის ჩასმა...

source: Insert Current File...
ar: أدرج الملف الحالي...
ka: მიმდინარე ფაილის ჩასმა...

source: Linker Options...
ar: خيارات الرابط...
ka: ლინკერის მორგება...

source: Build...
ar: ابنِ...
ka: აგება...

source: Upload...
ar: ارفع…
ka: ატვირთვა...

source: Processing Options...
ar: خيارات المعالجة...
ka: დამუშავების მორგება...

source: Split View Left/Right
ar: افصل العرض يمين/يسار
ka: ხედის მარჯვენა/მარცხენაზე გაყოფა

source: Split View Top/Bottom
ar: افصل العرض فوق/تحت
ka: ხედის ზედა/ქვედაზე გაყოფა

source: Run Simulation
ar: شغل المحاكاة
ka: სიმულაციის გაშვება

source: Pause Simulation
ar: أوقِف المحاكاة مؤقتًا
ka: სიმულაციის შეჩერება

source: Internals
ar: المكونات الداخلية
ka: შიდა

source: Square Wave
ar: موجة مربعة
ka: ოთხკუთხედი ტალღა

source: 2-Way Switch
ar: مفتاح ثنائي الاتجاه
ka: 2-მდგომარეობიანი გადამრთველი

source: 3-Way Switch
ar: مفتاح ثلاثي الاتجاه
ka: 3-მდგომარეობიანი გადამრთველი

source: Resistors in Parallel
ar: مقاومات على التوازي
ka: რეზისტორები პარალელურად

source: Resistors in Series
ar: مقاومات على التسلسل
ka: რეზისტორები მიმდევრობით

source: Voltage Divider
ar: مجزئ الجهد
ka: ძაბვის გამყოფი

source: Full Wave Rectifier
ar: مقوم موجة كاملة
ka: სრულტალღიანი-გამმართველი

source: Half Wave Rectifier
ar: مقوم نصف موجة
ka: ნახევარტალღიანი-გამმართველი

source: AND
ar: و
ka: და

source: NOR
ar: نفي أو
ka: ან-არა

source: OR
ar: أو
ka: ან

source: Decoupler
ar: فاصل
ka: დამშორებელი

source: Inverting Amplifier
ar: مضخم عاكس
ka: ინვერტორული გამაძლიერებელი

source: Noninverting Amplifier
ar: مضخم غير عاكس
ka: არაინვერტორული გამაძლიერებელი

source: Instrumentation Amplifier
ar: مضخم آلي
ka: გამზომი გამაძლიერებელი

source: Astable Multivibrator
ar: مذبذب متعدد غير مستقر
ka: არასტაბილური მულტივიბრატორი

source: Schmitt Trigger
ar: قادح شميت
ka: შმიტის გადამრთველი

source: Switch
ar: بدّل
ka: გადართვა

source: Close
ar: أغلق
ka: დახურვა

source: Save
ar: احفظ
ka: შენახვა

source: Reload
ar: أعد التحميل
ka: თავიდან ჩატვირთვა

source: Close All Others
ar: أغلق البقيّة
ka: ყველა დანარჩენის დახურვა

source: Open Location
ar: افتح موقعًا
ka: მდებარეობის გახსნა

source: Exiting...
ar: يخرج…
ka: გასვლა...

source: &Tools
ar: أ&دوات
ka: &ხელსაწყოები

source: Routing Mode
ar: وضع التوجيه
ka: რაუტინგის რეჟიმი

source: &File
ar: &ملف
ka: &ფაილი

source: &Edit
ar: &حرّر
ka: &ჩასწორება

source: &View
ar: &عرض
ka: &ჩვენება

source: Tools
ar: أ&دوات
ka: ხელსაწყოები

source: &Code Folding
ar: &طيّ الشفرة
ka: &კოდის დაკეცვა

source: &Settings
ar: إ&عدادات
ka: &პარამეტრები

source: Main Toolbar
ar: شريط الأدوات الرئيسي
ka: ხელსაწყოთა მთავარი ზოლი

source: &Debug
ar: ن&قّح
ka: &გამართვა

source: Debugger
ar: المنقّح
ka: გამმართველი

source: &Project
ar: م&شروع
ka: &პროექტი

source: Examples
ar: أمثلة
ka: მაგალითები

source: 555s
ar: 555ث
ka: 555-ები

source: Basic
ar: أساسي
ka: ძირითადი

source: Diodes
ar: صمامات ثنائية
ka: დიოდები

source: Matrix Display Drivers
ar: مشغلات عرض المصفوفة
ka: მატრიცული ეკრანის დრაივერები

source: Transistors
ar: ترانزستورات
ka: ტრანზისტორები

source: Opamps
ar: مضخمات العمليات
ka: ოპერაციული გამაძლიერებლები

source: *** Microbe generation successful ***
ar: *** توليد Microbe ناجح ***
ka: *** Microbe-ის გენერაცია წარამატებულია ***

source: *** Microbe generation failed ***
ar: *** توليد Microbe فاشل ***
ka: *** Microbe-ის გენერაცია ჩავარდა ***

source: Warning: Floating connection for %1
ar: تحذير: اتصال عائم لـ %1
ka: გაფრთხილება: მცურავი კავშირი %1-სთვის

source: KTechlab was unable to find the "Start" part. This must be included as the starting point for your program.
ar: تعذر على KTechlab معمل الدوائر إيجاد جزء "البدء". ضمِّنه كنقطة بدء لبرنامجك.
ka: KTechlab-მა ვერ იპოვა ნაწილი "Start". ეს თქვენი პროგრამის გაშვების მომენტში დაყენებული უნდა იყოს.

source: *** Assembly successful ***
ar: *** تجميع ناجح ***
ka: *** ასამბლერი წარმატებულია ***

source: *** Assembly failed ***
ar: *** تجميع فاشل ***
ka: *** ასამბლერი ჩავარდა ***

source: Assembly failed. Please check you have gputils installed.
ar: فشل التجميع. تحقق من تثبيت gputils لديك.
ka: ასამბლერის შეცდომა. შეამოწმეთ, გაქვთ gputils დაყენებული, თუ არა.

source: *** Disassembly successful ***
ar: *** فك التجميع ناجح ***
ka: *** დიზასამბლერი წარმატებულია ***

source: *** Disassembly failed ***
ar: *** فك التجميع فاشل ***
ka: *** დიზასამბლერი ჩავარდა ***

source: Disassembly failed. Please check you have gputils installed.
ar: فشل فك التجميع. تحقق من تثبيت gputils لديك.
ka: დიზასამბლერის შეცდომა. შეამოწმეთ, გაქვთ gputils დაყენებული, თუ არა.

source: *** Archiving successful ***
ar: *** أرشفة ناجحة ***
ka: *** დაარქივება წარმატებულია ***

source: *** Archiving failed ***
ar: *** فشلت الأرشفة ***
ka: *** დაარქივება ჩავარდა ***

source: Linking failed. Please check you have gputils installed.
ar: فشل الربط. تحقق من تثبيت gputils لديك.
ka: აწყობის შეცდომა. შეამოწმეთ, გაქვთ gputils დაყენებული, თუ არა.

source: *** Linking successful ***
ar: *** ربط ناجح ***
ka: *** აწყობა წარმატებულია ***

source: *** Linking failed ***
ar: *** ربط فاشل ***
ka: *** აწყობა ჩავარდა ***

source: These messages show the output of language-related functionality such as compiling and assembling.<br><br>For error messages, clicking on the line will automatically open up the file at the position of the error.
ar: تعرض هذه الرسائل مخرج الوظائف المتعلقة باللغة مثل التجميع والربط.<br><br>لرسائل الخطأ، النقر على السطر &يفتح آليًا الملف في موضع الخطأ.
ka: ეს შეტყობინებები შეიცავს ენაზე-დამოკიდებული ფუნქციონალის, როგორიცაა კომპილაცია და ასამბლერი, გამოტანილ შეტყობინებებს.<br><br>შეცდომის შეტყობინებებისთვის ხაზზე დაწკაპუნება ავტომატურად გახსნის ფაილს შეცდომის ადგილას.

source: *** Compilation failed ***
ar: *** تجميع فاشل ***
ka: *** კომპილაცია ჩავარდა ***

source: *** Compilation successful ***
ar: *** تجميع ناجح ***
ka: *** კომპილაცია წარმატებულია ***

source: Assembly failed. Please check you have KTechlab installed properly ("microbe" could not be started).
ar: فشل التجميع. تحقق من تثبيت KTechlab معمل الدوائر لديك بشكل صحيح (لا يمكن بدء "microbe").
ka: ასამბლერის შეცდომა. შეამოწმეთ, სწორადაა KTechlab დაყენებული, თუ არა (შეუძლებელია "microbe"-ის გაშვება).

source: Supported programmers: %1
ar: المبرمجون المدعومون: %1
ka: მხარდაჭერილი პროგრამატორები: %1

source: <br>Interface: Serial Port
ar: <br>واجهة: منفذ تسلسلي
ka: <br>ინტერფეისი: სერიული პორტი

source: <br>Interface: Parallel Port
ar: <br>واجهة: منفذ متوازي
ka: <br>ინტერფეისი: პარალელური პორტი

source: <br>Interface: USB Port
ar: <br>واجهة: منفذ USB
ka: <br>ინტერფეისი: USB პორტი

source: <br>Interface: Serial Port and Parallel Port
ar: <br>واجهة: منفذ تسلسلي ومنفذ متوازي
ka: <br>ინტერფეისი: სერიული პორტი და პარალელური პორტი

source: *** Programming successful ***
ar: *** برمجة ناجحة ***
ka: *** დაპროგრამება წარმატებულია ***

source: *** Programming failed ***
ar: *** برمجة فاشلة ***
ka: *** დაპროგრამება ჩავარდა ***

source: Building: %1
ar: يبني: %1
ka: აგება: %1

source: Could not find PIC with ID "%1".
ar: لا يمكن إيجاد PIC بالهوية "%1".
ka: ვერ ვიპოვე PIC ID-ით "%1".

source: Compilation failed. Please check you have sdcc installed.
ar: فشل التجميع. تحقق من تثبيت sdcc لديك.
ka: კომპილაცია ჩავარდა. შეამოწმეთ, დაყენებული გაქვთ, თუ არა sdcc.

source: Circular 2-Wheel Chassis
ar: هيكل دائري بعجلتين
ka: წრიული 2-ბორბლიანი შასი

source: Chassis'
ar: هيكل ميكانيكي
ka: შასი

source: Mass
ar: الكتلة
ka: მასა

source: Moment of Inertia
ar: عزم القصور الذاتي
ka: ინერციის მომენტი

source: Advanced...
ar: متقدّم...
ka: დამატებით...

source: Do not know how to build "%1" (output URL is empty).
ar: لا أعرف كيف أبني "%1" (عنوان URL للإخراج فارغ).
ka: არ ვიცი, როგორ ავაგო "%1" (გამოტანის URL ცარიელია).

source: Do not know how to build "%1" (library does not exist in project).
ar: لا أعرف كيف أبني "%1" (المكتبة غير موجودة في المشروع).
ka: არ ვიცი, როგორ ავაგო "%1" (პროექტში ბიბლიოთეკა არ არსებობს)

source: Do not know how to build "%1" (unknown output type).
ar: لا أعرف كيف أبني "%1" (نوع الإخراج غير معروف).
ka: არ ვიცი, როგორ ავაგო "%1" (უცნობი გამოტანის ტიპი).

source: Project could not be saved to "%1"
ar: لا يمكن حفظ المشروع في "%1"
ka: პროექტის "%1"-ში შენახვა შეუძლებელია

source: Saving Project
ar: احفظ المشروع
ka: პროექტის შენახვა

source: Displays the list of files in the project. To open or close a project, use the "Project" menu. Right click on a file to remove it from the project
ar: يعرض قائمة الملفات في المشروع. لفتح أو إغلاق مشروع، استخدم قائمة "المشروع". انقر باليمين على ملف لإزالته من المشروع
ka: აჩვენებს პროექტის ფაილების სიას. იმისათვის, რომ პროექტი გახსნათ, ან დახუროთ, გამოიყენეთ მენიუ "პროექტი". მარჯვენა წკაპი ფაილზე მისი პროექტიდან წასაშლელად

source: Project Manager
ar: مدير المشروع
ka: პროექტის მმართველი

source: KTechlab Project
ar: مشروع KTechlab معمل الدوائر
ka: KTechLab-ის პროექტო

source: Do you really want to remove "%1"?
ar: هل تريد حقًا إزالة "%1"؟
ka: მართლა გნებავთ "%1"-ის წაშლა?

source: Remove Project File?
ar: أزِل ملف المشروع؟
ka: წავშალო პროექტის ფაილი?

source: Failed to create editor
ar: فشل إنشاء المحرر
ka: რედაქტორის შექმნა ჩავარდა

source: Unknown code type.
ar: نوع تعمية غير معروف.
ka: უცნობი კოდის ტიპი.

source: Cannot debug
ar: لا يمكن التصحيح
ka: გამართვა შეუძლებელია

source: Cannot debug hex.
ar: لا يمكن تصحيح سداسي عشر.
ka: თექვსმეტობითი გამართვა შეუძლებელია.

source: Format Assembly Code
ar: نسِّق تعمية التجميع
ka: ასამბლერის კოდის დაფორმატება

source: Set &Breakpoint
ar: ض&ع نقطة توقف
ka: გამართვის წერტილის დაყენე&ბა

source: Run
ar: شغّل
ka: გაშვება

source: Stop
ar: أوقف
ka: შეჩერება

source: Step Over
ar: تخطّ
ka: გადაბიჯება

source: Step Out
ar: اخرج
ka: გამობიჯება

source: Line: %1 Col: %2
ar: السّطر: %1 العمود: %2
ka: ხაზი: %1 სვეტი: %2

source: Clear &Breakpoint
ar: أزِل نقطة التوقف
ka: გამართვის წერტილის გასუფთავე&ბა

source: True
ar: صحيح
ka: სიმართლე

source: False
ar: خطأ
ka: ტყუილი

source: (empty)
ar: (فارغة)
ka: (ცარიელი)

source: Open Document
ar: افتح مستندًا
ka: დოკუმენტის გახსნა

source: NAND
ka: და-არა

source: JFETs
ka: JFET-ები

source: MOSFETs
ka: MOSFET-ები
