Repository: KDE/ktechlab
Catalog: po/*/ktechlab.po
Languages: ar, ka

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
ka: რუსუდან ცისკრელი

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
ka: Temuri.doghonadze@gmail.com

source: Microbe
ar: ميكروب

source: The Microbe Compiler
ar: مُصرف الميكروب
ka: The Microbe -ის კომპილატორი

source: (C) 2004-2005, The KTechlab developers
ar: (C) 2004-2005، مطورو معمل الدوائر
ka: (C) 2004-2005, KTechlab დეველოპერები

source: Daniel Clarke
ar: دانييل كلارك
ka: დანიელ კლარკი

source: David Saxton
ar: ديفيد ساكستون
ka: დევიდ საქსტონი

source: George John
ar: جورج يوحنا
ka: ჯორჯ ჯონი

source: Added pic 16f877,16f627 and 16f628
ar: أُضيف PIC 16f877 و16f627 و16f628
ka: დამატებულია სურათები 16f877,16f627 და 16f628

source: Show source code lines in assembly output
ar: أظهر أسطر شفرة المصدر في خرج التجميع
ka: წყარო კოდის ხაზების ჩვენება ასემბლერის გამონატანში

source: Do not attempt optimization of generated instructions.
ar: لا تُحاول تحسين التعليمات المُنشأة.
ka: დაგენერირებული ინსტრუქციების ოპტიმიზაციის მცდელობა არ მოხდება.

source: Input filename
ar: اسم ملف الإدخال
ka: შეიყვანეთ ფაილის სახელი

source: Output filename
ar: اسم ملف الخرج
ka: გამოტანის ფაილის სახელი

source: Could not open file '%1'
ar: لم أستطع فتح الملف '%1'
ka: ფაილ %1-ის გახსნა შეუძლებელია: %1

source: Unknown statement
ar: بيان غير معروف
ka: უცნობი ოპერატორი

source: Port '%1' is not supported by target PIC
ar: منفذ '%1' لا يدعمه PIC الهدف
ka: პორტი '%1' სამიზნე PIC-ის მიერ მხარდაჭერილი არაა

source: Pin identifier was not followed by '='
ar: مُعرِّف الدبوس لم يتبعه '='
ka: კონტაქტის იდენტიფიკატორს არ მოჰყვება '='

source: Pin state can only be 'high' or 'low'
ar: حالة الدبوس يمكن أن تكون فقط 'مرتفعة' أو 'منخفضة'
ka: კონტაქტის მნიშვნელობა შეიძლება იყოს მხოლოდ 'high' (მაღალი), ან 'low' (დაბალი)

source: Invalid token '%1'. Port identifier should be followed by '='
ar: رمز غير صالح '%1'. يجب أن يتبع مُعرِّف المنفذ بـ '='
ka: არასწორი ტოკენი '%1'. პორტის იდენტიფიკატორს უნდა მოსდევდეს სიმბოლო '='

source: Unexpected statement before '{'
ar: بيان غير متوقع قبل '{'
ka: მოულოდნელი ინსტრუქცია სიმბოლომდე '{'

source: Mismatched brackets in expression '%1'
ar: أقواس غير متطابقة في التعبير '%1'
ka: ფრჩხილები არ ემთხვევა გამოსახულებაში '%1'

source: Invalid '=' found in expression
ar: عُثر على علامة '=' غير صالحة في التعبير
ka: გამოსახულებაში აღმოჩენილია არასწორი '='

source: Reserved keyword '%1' cannot be a variable name.
ar: الكلمة المفتاحية المحجوزة '%1' لا يمكن أن تكون اسم متغير.
ka: დაცულ საკვანძო სიტყვას '%1' ცვლადის სახელად ვერ გამოიყენებთ.

source: Nothing between operators
ar: لا شيء بين العوامل
ka: სიცარიელე ოპერატორებს შორის

source: Missing operator or space in operand
ar: عامل مفقود أو مسافة في المُعامَل
ka: ნაკლული ოპერატორი, ან ჰარე ოპერანდში

source: Unknown variable
ar: متغير غير معروف
ka: უცნობი ცვლადი

source: Unknown variable '%1'
ar: متغير غير معروف '%1'
ka: უცნობი ცვლადი '%1'

source: Could not open include file '%1'
ar: لم أستطع فتح ملف التضمين '%1'
ka: ვერ გავხსენი ჩასასმელი ფაილი '%1'

source: Division by zero
ar: قسمة على الصفر
ka: ნულზე გაყოფა

source: Number too big
ar: الرقم كبير جداً
ka: რიცხვი ძალიან დიდია

source: Step can only be a constant expression
ar: الخطوة يمكن أن تكون تعبيراً ثابتاً فقط
ka: ნაბიჯი, მხოლოდ, მუდმივი გამოსახულება შეიძლება, იყოს

source: Delay must be a positive constant value
ar: يجب أن يكون التأخير قيمة ثابتة موجبة
ka: დაყოვნება დადებითი მთელი რიცხვი უნდა იყოს

source: 'high' or 'low' expected after pin expression '%1'
ar: توقع 'high' أو 'low' بعد تعبير الدبوس '%1'
ka: კონტაქტის გამოსახულების '%1' შემდეგ მოველოდი 'high' (მაღალს), ან 'low' (დაბალს)

source: Comparison operator in '%1' is not recognized
ar: عامل المقارنة في '%1' غير مُتعرَّف عليه
ka: '%1'-ში შედარების ოპერატორი ამოცნობილი არაა

source: Subroutine definition before end of program
ar: تعريف روتين فرعي قبل نهاية البرنامج
ka: ქვეპროგრამის აღწერა პროგრამის დასასრულამდე

source: Interrupt routine definition before end of program
ar: تعريف روتين المقاطعة قبل نهاية البرنامج
ka: წყვეტის პროცედურის აღწერა პროგრამის დასასრულამდე

source: Label expected
ar: توقّعت لصيقة
ka: მოველოდი ჭდეს

source: Extra tokens at end of line
ar: رموز إضافية في نهاية السطر
ka: დამატებითი სიმბოლოები ხაზის ბოლოში

source: Expected '%1'
ar: متوقع '%1'
ka: მოველოდი '%1'

source: Pin list expected
ar: توقع قائمة دبابيس
ka: მოველოდი კონტაქტების სიას

source: Alias already defined
ar: الاسم المستعار مُعرَّف بالفعل
ka: მეტსახელი უკვე აღწერილია

source: Interrupt type not supported by target PIC
ar: نوع المقاطعة لا يدعمه PIC الهدف
ka: წყვეტის ტიპი სამიზნე PIC-ის მიერ მხარდაჭერილი არაა

source: Interrupt already defined
ar: المقاطعة مُعرَّفة بالفعل
ka: წყვეტა უკვე არწერილია

source: Variable '%1' is read only
ar: المتغير '%1' للقراءة فقط
ka: ცვლადი '%1' მხოლოდ-წაკითხადია

source: Variable '%1' is write only
ar: المتغير '%1' للكتابة فقط
ka: ცვლადი '%1' მხოლოდ ჩაწერადია

source: Invalid pin list size
ar: حجم قائمة الدبابيس غير صالح
ka: პინების სიის არასწორი ზომა

source: Variable '%1' is already defined
ar: المتغير '%1' مُعرَّف بالفعل
ka: ცვლადი '%1' უკვე აღწერილია

source: '%1' is not a valid variable name
ar: '%1' ليس اسم متغير صالح
ka: '%1' ცვლადის მისაღებ სახელს არ წარმოადგენს

source: Variable expected
ar: توقّعت متغيّرًا
ka: მოველოდი ცვლადს

source: Name expected
ar: توقع اسم
ka: მოველოდი სახელს

source: Internal issue: Optimization has not finished in %1 iterations.
ar: مشكلة داخلية: التحسين لم ينتهِ في %1 تكرار.
ka: შიდა შეცდომა: ოპტიმიზაცია არ დასრულებულა %1 იტერაციაში.

source: Dump linear equations
ar: افْرُغْ المعادلات الخطية
ka: წრფივი ტოლობების დამპი

source: 0 Degrees
ar: 0 درجة
ka: 0 გრადუსი

source: 90 Degrees
ar: 90 درجة
ka: 90 გრადუსი

source: 180 Degrees
ar: 180 درجة
ka: 180 გრადუსი

source: 270 Degrees
ar: 270 درجة
ka: 270 გრადუსი

source: Create Subcircuit
ar: أنشئ دائرة فرعية
ka: ქვეწრედის შექმნა

source: Rotate Clockwise
ar: أدر باتجاه عقارب الساعة
ka: საათის ისრის მიმართულებით შებრუნება

source: Rotate Counter-Clockwise
ar: أدر بعكس اتجاه عقارب الساعة
ka: საათის ისრის მოძრაობის საწინააღმდეგო მიმართულებით შებრუნება

source: Flip Horizontally
ar: اقلب أفقيا
ka: ჰორიზონტალურად გადაბრუნება

source: Flip Vertically
ar: اقلب رأسيا
ka: ვერტიკალურად გადაბრუნება

source: Construct a circuit by dragging components from the Component selector from the left. Create the connections by dragging a wire from the component connectors.<br><br>The simulation is running by default, but can be paused and resumed from the Tools menu.<br><br>To delete a wire, select it with a select box, and hit delete.<br><br>To edit the attributes of a component, select it (making sure that no components of another type are also selected), and edit in the toolbar. More advanced properties can be edited using the item editor on the right.<br><br>Subcircuits can be created by connecting the components with an External Connection, selecting the desired components and clicking on "Create Subcircuit" in the right-click menu.
ar: ابْنِ دائرة بسحب المكونات من مُحدِّد المكونات على اليسار. أنشئ التوصيلات بسحب سلك من موصلات المكونات.<br><br>المحاكاة قيد التشغيل مبدئي، ولكن يمكن إيقافها مؤقتاً واستئنافها من قائمة الأدوات.<br><br>لِحَذْف سلك، حدّده بصندوق تحديد، واضغط على حذف.<br><br>لِتَعْدِيل سمات مكون، حدّده (مُتأكِّداً من عدم تحديد مكونات أخرى من نوع آخر أيضاً)، وعَدِّلْه في شريط الأدوات. يمكن تعديل الخصائص الأكثر تقدماً باستخدام مُحرِّر العناصر على اليمين.<br><br>يمكن إنشاء دوائر فرعية بتوصيل المكونات باتصال خارجي، وتحديد المكونات المطلوبة والنقر على "أنشئ دائرة فرعية" في قائمة النقر بزر الفأرة الأيمن.
ka: ააშენეთ წრე კომპონენტის სელექტორიდან კომპონენტების მარცხნიდან გადატანით. შექმენით კავშირები კომპონენტის კონექტორებიდან მავთულის გადატანით.<br><br>სიმულაცია მუშაობს ნაგულისხმევად, მაგრამ შეიძლება შეჩერდეს და განახლდეს ინსტრუმენტების მენიუდან.<br><br>მავთულის წასაშლელად, შეარჩიეთ იგი შერჩეული ყუთით და დააჭირეთ წაშლას.<br><br>კომპონენტის ატრიბუტების რედაქტირებისთვის შეარჩიეთ იგი (დარწმუნდით, რომ სხვა ტიპის კომპონენტებიც არ არის შერჩეული) და დაარედაქტირეთ ინსტრუმენტთა პანელში. უფრო მოწინავე თვისებების რედაქტირება შესაძლებელია მარჯვნივ ნივთის რედაქტორის გამოყენებით.<br><br>ქვეწრიკების შექმნა შესაძლებელია კომპონენტების გარე კავშირთან შეერთებით, სასურველი კომპონენტების არჩევით და მარჯვენა ღილაკით მენიუში "შექმნა ქვეცირკულაციის შექმნაზე".

source: Simulation Initializing
ar: المحاكاة تُهيَّأ
ka: სიმულაციის ინიციალიზაცია

source: Simulation Running
ar: المحاكاة قيد التشغيل
ka: სიმულაცია გაშვებულია

source: Simulation Paused
ar: المحاكاة مُوقفة مؤقتاً
ka: სიმულაცია შეჩერებულია

source: Maximum number of undo steps
ar: الحد الأقصى لعدد خطوات التراجع
ka: დაბრუნების ბიჯების რაოდენობა

source: Restore Documents on Startup
ar: اسْتَعِدْ المستندات عند بدء التشغيل
ka: გაშვებისას დოკუმენტების აღდგენა

source: Raise appropriate Item Selector on document creation
ar: ارْفَعْ مُحدِّد العناصر المناسب عند إنشاء المستند
ka: შესაბამისი ელემენტის ამრჩევის ჩვენება დოკუმენტის შექმნისას

source: Raise Messages Log on Compiling
ar: ارْفَعْ سجل الرسائل عند التصريف
ka: შეტყობინებების ჟურნალის ჩვენება კომპილაციისას

source: Show Voltage Bars
ar: أَظْهِرْ أشرطة الجهد
ka: ვოლტაჟის ზოლების ჩვენება

source: Show Voltage as Color
ar: أَظْهِرْ الجهد كلون
ka: ვოლტაჟის ფერებად ჩვენება

source: Animate Wires (current or power)
ar: حَرِّكْ الأسلاك (تيار أو طاقة)
ka: სადენების ანიმაცია (დენი, ან კვება)

source: Refresh Rate
ar: معدّل التّحديث
ka: განახლების სიხშირე

source: Color of grid lines
ar: لون خطوط الشبكة
ka: ბადის ხაზების ფერი

source: Whether the grid should be shown.
ar: سواء يجب إظهار الشبكة.
ka: უნდა იყოს თუ არა ნაჩვენები ბადე.

source: Whether the same output should be use for generation of code, etc
ar: سواء يجب استخدام نفس الإخراج لتوليد الشفرة، وما إلى ذلك
ka: უნდა იყოს თუ არა გამოყენებული იგივე გამოტანის ველი კოდის გენერაციისთვის და ა.შ

source: Indentation of Instruction Names
ar: إزاحة أسماء التعليمات
ka: ინსტრუქციის სახელების შეწევა

source: Indentation of Instruction Data
ar: إزاحة بيانات التعليمات
ka: ინსტრუქციის მონაცემების შეწევა

source: Indentation of Comments
ar: إزاحة التعليقات
ka: კომენტარების შეწევა

source: Indentation of 'equ'
ar: إزاحة 'equ'
ka: 'equ'-ის შეწევა

source: Indentation of 'equ' Value
ar: إزاحة قيمة 'equ'
ka: 'equ'-ის მნიშვნელობის შეწევა

source: Automatically format Microbe output
ar: نَسِّقْ خرج الميكروب آلي
ka: Microbe-ის გამოტანის ავტომატური დაფორმატება

source: Logic Symbol Shapes
ar: أشكال الرموز المنطقية
ka: ლოგიკური სიმბოლოების ფორმა

source: Rising Trigger Threshold
ar: عتبة القادح الصاعد
ka: გადამრთველების ჩართვის ზღვარი

source: Falling Trigger Threshold
ar: عتبة القادح الهابط
ka: გადამრთველების გამორთვის ზღვარი

source: Logic Output High
ar: الخرج المنطقي مرتفع
ka: ლოგიკური გამოტანა მაღალია

source: Logic Output High Impedance
ar: ممانعة الخرج المنطقي مرتفعة
ka: იმპედანსი გამოყვანის მაღალ დონეზე

source: Logic Output Low Impedance
ar: ممانعة الخرج المنطقي منخفضة
ka: იმპედანსი გამოყვანის დაბალ დონეზე

source: Hex Format
ar: تنسيق سداسي عشري
ka: თექვსმეტობითი ფორმატი

source: Radix
ar: أساس
ka: ფესვი

source: GpasmWarning Level
ar: مستوى تحذير Gpasm
ka: Gpasm-ის გაფრთხილების დონე

source: Ignore Case
ar: تجاهل الحالة
ka: რეგისტრის იგნორი

source: Dos Formatting
ar: تنسيق دوس
ka: DOS-ის დაფორმატება

source: Other Options
ar: خيارات أخرى
ka: სხვა პარამეტრები

source: Do not search in the standard library directory
ar: لا تَبْحَثْ في دليل المكتبة القياسية
ka: სტანდარტული ბიბლიოთეკების საქაღალდეში ძებნა არ მოხდება

source: Do not search in the standard include directory
ar: لا تَبْحَثْ في دليل التضمين القياسي
ka: სტანდარტული ჩასმის საქაღალდეში ძებნა არ მოხდება

source: Disable pedantic warnings
ar: عَطِّلْ التحذيرات الأصولية
ka: პედანტური გაფრთხილებების გამორთვა

source: Strictly follow the C89 standard
ar: اتْبَعْ معيار C89 بِصرامة
ka: C89 სტანდარტის მკადრი მიყოლა

source: Strictly follow the C99 standard
ar: اتْبَعْ معيار C99 بِصرامة
ka: C99 სტანდარტის მკადრი მიყოლა

source: Stack automatic variables
ar: مُتغيّرات مكدس تلقائية
ka: ავტომატური ცვლადების სტეკში განლაგება

source: Integer libraries have been compiled as reentrant
ar: مكتبات الأعداد الصحيحة صُرِّفت على أنها قابلة لإعادة الدخول
ka: მთელრიცხვიანი ბიბლიოთეკები აგებულია მეორადი ჩატვირთვისთვის

source: Floating point library has been compiled as reentrant
ar: مكتبة الفاصلة العائمة صُرِّفت على أنها قابلة لإعادة الدخول
ka: მცურავრიცხვიანი ბიბლიოთეკა აგებულია მეორადი ჩატვირთვისთვის

source: Leave out the frame pointer
ar: اتْرُكْ مؤشر الإطار
ka: ჩარჩოზე მაჩვენებლის გამოტოვება

source: Do not memcpy initialized data from code space to xdata space
ar: لا تَنْسَخْ الذاكرة للبيانات المُهيَّأة من مساحة الشفرة إلى مساحة xdata
ka: ინიციალიზებული მონაცემების კოდის სივრციდან xdata-ის სივრცეში memcpy არ მოხდება

source: Callee will always save registers used
ar: المستدعَي سيَحْفَظ دائماً السجلات المستخدمة
ka: გამოძახებული ყოველთვის ინახავს გამოყენებულ რეგისტრებს

source: Do not overlay parameters and local variables
ar: لا تُغَطِّ معاملات ومتغيرات محلية
ka: პარამეტრები და ლოკალური ცვლადები არ გადალაგდება

source: Disable the GCSE optimization
ar: عَطِّلْ تحسين GCSE
ka: GCSE ოპტიმიზაციის გამორთვა

source: Do not optimize labels
ar: لا تُحسِّنْ لصائق
ka: ჭდეების ოპტიმიზაციის გამორთვა

source: Disable optimization of invariants
ar: عَطِّلْ تحسين الثوابت
ka: მუდმივი მნიშვნელობების ოპტიმიზაციის გამორთვა

source: Disable loop variable induction
ar: عَطِّلْ حث متغير الحلقة
ka: ციკლის ცვლადების ინდუქციის გამორთვა

source: Disable peep-hole optimization
ar: عَطِّلْ تحسين ثقب النظر
ka: პირდაპირი წვდომის ოპტიმიზაციის გამორთვა

source: Do not do loop reversal optimization
ar: لا تَقُمْ بتحسين عكس الحلقة
ka: მარყუჟის რევერსის ოპტიმიზაციის გამორთვა

source: Optimize for compact code
ar: حَسِّنْ للحصول على شفرة مضغوطة
ka: კომპაქტური კოდისთვის ოპტიმიზაცია

source: Optimize for fast code
ar: حَسِّنْ للحصول على شفرة سريعة
ka: სწრაფი კოდისთვის ოპტიმიზაცია

source: Pass inline assembler code through peep hole optimizer
ar: مَرِّرْ شفرة المجمّع الداخلية عبر مُحسِّن ثقب النظر
ka: ჩაშენებული ასამბლერის კოდის გატარება პირდაპირი წვდომის ოპტიმიზატორის გავლით

source: Do not generate boundary check for jump tables
ar: لا تُوَلِّدْ فحص حدود لجداول القفز
ka: არ მოხდება გადასვლის ზღვრების შემოწმება გადასვლის ცხრილებისთვის

source: Do not use default libraries
ar: لا تَسْتَخْدِمْ المكتبات المبدئي
ka: ნაგულისხმევი ბიბლიოთეკები გამოყენებული არ იქნება

source: Do not generate BANKSEL directives
ar: لا تُوَلِّدْ توجيهات BANKSEL
ka: არ მოხდება BANSKEL-ის დირექტივების გენერაცია

source: Use large stack model
ar: اسْتَخْدِمْ نموذج المكدس الكبير
ka: დიდი სტეკის მოდელის გამოყენება

source: Show more debug info in assembly output
ar: أَظْهِرْ المزيد من معلومات التنقيح في خرج التجميع
ka: მეტი გამართვის ინფორმაციის ჩვენება ასამბლერის გამოტანაში

source: Explicit enable of peepholes
ar: تمكين صريح لثقوب النظر
ka: პირდაპირი წვდომის წერტილების აშკარა ჩართვა

source: Dump call tree in .calltree file
ar: افْرُغْ شجرة الاستدعاء في ملف .calltree
ka: გამოძახებების ხის დამპი ფაილში .calltree

source: Enable stack optimizations
ar: فَعِّلْ تحسينات المكدس
ka: სტეკის ოპტიმიზაციების ჩართვა

source: Try to use conditional BRA instead of GOTO
ar: حاوِلْ استخدام BRA شرطي بدلاً من GOTO
ka: პირობის მქონე BRA-ის გამოყენების ცდა GOTO-ის მაგიერ

source: Try to optimize some compares
ar: حاوِلْ تحسين بعض المقارنات
ka: ზოგიერთი შედარების ოპტიმიზაციის ცდა

source: Thorough data flow analysis
ar: تحليل مُعمَّق لتدفق البيانات
ka: მონაცემთა დინების გულმოდგინე ანალიზი

source: Search / include non-free licensed libraries and header files
ar: ابْحَثْ / ضَمِّنْ المكتبات وملفات الترويسة غير الحرة المُرخَّصة
ka: არათავისუფალი ლიცენზიის მქონე ბიბლიოთეკებისა და თავსართი ფაილების ძებნა / ჩასმა

source: Location where SDCC in installed
ar: الموقع الذي ثُبِّتَ فيه SDCC
ka: მდებარეობა, სადაც SDCC-ია დაყენებული

source: The application to use to program the PIC.
ar: التطبيق الذي اسْتَخْدِمْه لبرمجة PIC.
ka: PIC-ის გასაპროგრამებლად გამოყენებული აპლიკაცია.

source: The device (serial, parallel, etc...) used to program the PIC.
ar: الجهاز (التسلسلي، المتوازي، إلخ...) الذي اسْتَخْدِمْه لبرمجة PIC.
ka: PIC-ის დასაპროგრამებლად გამოყენებული მოწყობილობა (სერიული, პარალელური და ა.შ.).

source: Check this if SDCC uses shared libs for compiling (newer SDCC does so)
ar: ضَعْ علامة هنا إذا كان SDCC يَسْتَخْدِمُ المكتبات المشتركة للتصريف (SDCC الأحدث يَفْعَلُ ذلك)
ka: შემოწმება, იყენებს თუ არა SDCC გაზიარებულ ბიბლიოთეკებს კომპილაციისთვის (ახალი SDCC შვრება ამას)

source: KTechLab
ar: KTechLab معمل الدوائر

source: An IDE for microcontrollers and electronics
ar: بيئة تطوير متكاملة للمتحكمات الدقيقة والإلكترونيات
ka: IDE მიკროელექტრონიკისა და ელექტრონიკისთვის

source: (C) 2003-2017, The KTechLab developers
ar: (C) 2003-2017، مطورو معمل الدوائر
ka: (C) 2003-2017, KTechLab-ის პროგრამისტები

source: Alan Grimes
ar: آلان غرايمز

source: Developer, Simulation
ar: مطور، محاكاة

source: Zoltan Padrah
ar: زولتان بادراه

source: Developer
ar: مطوّر
ka: პროგრამისტი

source: Julian Bäume
ar: جوليان باوم

source: Developer, KDE4 Port, GUI
ar: مطور، نقل لـ KDE4، واجهة المستخدم الرسومية
ka: გადატანა KDE4-ზე, გრაფიკული ინტერფეისი, პროგრამისტი

source: Juan De Vincenzo
ar: خوان دي فيتشنزو

source: KDE4 Port
ar: النقل إلى كِيدِي
ka: KDE4-ზე გადატანა

source: Lawrence Shafer
ar: لورنس شيفر

source: Website, wiki and forum
ar: الموقع، الويكي والمنتدى
ka: ვებსაიტი, ვიკი და ფორუმი

source: Jason Lucas
ar: جيسون لوكاس

source: Keeping up the project during lack of developers
ar: الاستمرار في المشروع أثناء نقص المطورين
ka: პროექტის შენარჩუნება მაშინ, როცა პროგრამისტები ცოტანი იყვნენ

source: Former developer, project founder, former maintainer
ar: مطور سابق، مؤسس المشروع، مُصان سابق
ka: ყოფილი პროგრამისტი, პროექტის დამფუძნებელი, ყოფილი წამყვანი პროგრამისტი

source: Former developer
ar: مطور سابق
ka: ყოფილი პროგრამისტი

source: Couriousous
ar: كوريوسوس

source: JK flip-flop, asynchronous preset/reset in the D flip-flop
ar: قَلاّب JK، ضبط/إعادة ضبط غير متزامن في قَلّاب D
ka: JK ტრიგერი, ასინქრონული პრესეტი/ჩამოყრა D ტრიგერში

source: Rotary Switch
ar: مفتاح دوار
ka: მბრუნავი გადამრთველი

source: John Myers
ar: جون مايرز

source: Ali Akcaagac
ar: علي أكجاغاتش

source: Glib friendliness
ar: ودّ Glib
ka: თავსებადობა Glib-თან

source: David Leggett
ar: ديفيد ليجيت

source: Former website hosting and feedback during early development
ar: الاستضافة السابقة للموقع والتغذية الراجعة أثناء التطوير المبكر
ka: ყოფილი ვებსაიტის ჰოსტი და უკუკავშირი ადრეული ვერსიების დროს

source: Document to open.
ar: المستند لفتحه.
ka: გასახსნელი დოკუმენტი.

source: Could not open '%1'
ar: تعذّر فتح '%1'
ka: %1-ის გახსნა შეუძლებელია

source: Untitled (Circuit %1)
ar: بلا عنوان (دائرة %1)
ka: უსახელო (წრედი %1)

source: Untitled (Circuit)
ar: بلا عنوان (دائرة)
ka: უსახელო (წრედი)

source: Untitled (FlowCode %1)
ar: بلا عنوان (شفرة انسيابية %1)
ka: უსახელო (FlowCode %1)

source: Untitled (FlowCode)
ar: بلا عنوان (شفرة انسيابية)
ka: უსახელო (FlowCode)

source: Untitled (Mechanics %1)
ar: بلا عنوان (ميكانيكا %1)
ka: უსახელო (Mechanics %1)

source: Untitled (Mechanics)
ar: بلا عنوان (ميكانيكا)
ka: უსახელო (Mechanics)

source: Untitled (%1)
ar: غير معنون (%1)
ka: უსახელო (%1)

source: Untitled
ar: غير معنون
ka: უსახელო

source: Could not open Circuit file "%1"
ar: لم أستطع فتح ملف الدائرة "%1"
ka: ვერ გავხსენი წრედის ფაილი "%1"

source: Could not open FlowCode file "%1"
ar: لم أستطع فتح ملف الشفرة الانسيابية "%1"
ka: ვერ გავხსენი FlowCode-ის ფაილი "%1"

source: Could not open Mechanics file "%1"
ar: لم أستطع فتح ملف الميكانيكا "%1"
ka: ვერ გავხსენი Mechanics-ის ფაილი "%1"

source: Could not open text file "%1"
ar: لم أستطع فتح الملف النصي "%1"
ka: ვერ გავხსენი ტექსტური ფაილი "%1"

source: Save Location
ar: احفظ المكان
ka: მდებარეობის შენახვა

source: A file named "%1" already exists. Are you sure you want to overwrite it?
ar: الملفّ بالاسم "%1" موجود فعلًا. أمتأكّد من الكتابة فوقه؟
ka: ფაილი "%1" სახელით უკვე არსებობს. შევცვალო?

source: Overwrite File?
ar: أأكتب فوق الملفّ؟
ka: ჩავანაცვლო ფაილი?

source: The document '%1' has been modified. Do you want to save it?
ar: لقد تغير المستند "%1" . هل تريد حفظه ؟
ka: დოკუმენტი '%1' შეიცვალა. გნებავთ, შეინახოთ ის?

source: Save Document?
ar: حفظ المستند؟
ka: შევინახო დოკუმენტი?

source: Other
ar: أخرى
ka: სხვები

source: Image
ar: صورة
ka: გამოსახულება

source: Image File
ar: ملفّ الصّورة
ka: ასლის ფაილი

source: Line
ar: السّطر
ka: ხაზი

source: Line Color
ar: لون السطر
ka: ხაზის ფერი

source: Line Width
ar: سمك السطر
ka: ხაზის სიგანე

source: Line Style
ar: نمط السطر
ka: ხაზის სტილი

source: Cap Style
ar: طراز الغطاء
ka: ბოლოს სტილი

source: Arrow
ar: سهم
ka: ისარი

source: Head angle
ar: زاوية الرأس
ka: მიმმართველის კუთხე

source: Canvas Text
ar: نص اللوحة
ka: ტექსტი ტილოზე

source: Text
ar: النص
ka: ტექსტი

source: Display Background
ar: خلفية العرض
ka: ფონის ჩვენება

source: Background Color
ar: لون الخلفيّة
ka: ფონის ფერი

source: Frame Color
ar: لون الإطار
ka: ჩარჩოს ფერი

source: Solid
ar: صلب
ka: მყარი

source: None
ar: لا شيء
ka: არცერტი

source: Dash
ar: شَرْطة
ka: პანელი

source: Dot
ar: نقطة
ka: წერტილი

source: Dash Dot
ar: شَرْطة نقطة
ka: ტირე, წერტილი

source: Dash Dot Dot
ar: شَرْطة نقطة نقطة
ka: ტირე, წერტილი, წერტილი

source: Flat
ar: مسطح
ka: ბრტყელი

source: Square
ar: مربع
ka: კვადრატი

source: Round
ar: دائري
ka: მრგვალი

source: Rectangle
ar: مستطيل
ka: მართკუთხედი

source: Ellipse
ar: بيضاوي
ka: ოვალი

source: Orientation
ar: الاتّجاه
ka: ორიენტაცია

source: All Files
ar: كلّ الملفّات
ka: ყველა ფაილი

source: Circuit
ar: دارة
ka: წრედი

source: No components were found in the selection.
ar: لم يُعثَر على مكونات في التحديد.
ka: მონიშნულში კომპონენტები აღმოჩენილი არაა.

source: No External Connection components were found in the selection.
ar: لم يُعثَر على مكونات اتصال خارجي في التحديد.
ka: მონიშნულში გარე კავშირის კომპონენტები აღმოჩენილი არაა.

source: Integrated Circuits
ar: الدوائر المتكاملة
ka: ინტეგრალური სქემები

source: Analog-Digital
ar: تناظري-رقمي
ka: ანალოგურ-ციფრული

source: Digital-Analog
ar: رقمي-تناظري
ka: ციფრულ-ანალოგური

source: Number Bits
ar: عدد البتات
ka: ბიტების რაოდენობა

source: Input Range
ar: نطاق الإدخال
ka: შეყვანის შუალედი

source: ADC
ar: ADC محوّل تناظري-رقمي

source: DAC
ar: DAC محوّل رقمي-تناظري

source: Bidirectional LED
ar: صمام ثنائي باعث للضوء ثنائي الاتجاه
ka: ორმხრივი LED

source: Outputs
ar: المخرجات
ka: გამოტანა

source: Color 1
ar: اللون 1
ka: ფერი 1

source: Colour 2
ar: اللون 2
ka: ფერი 2

source: Binary Counter
ar: عداد ثنائي
ka: ორობითი მთვლელი

source: Trigger Edge
ar: حافة القادح
ka: გადამრთველის წიბო

source: Rising
ar: يصعد
ka: ამომავალი

source: Falling
ar: يهبط
ka: ეცემა

source: Bit Count
ar: عد البت
ka: ბიტების რაოდენობა

source: Bus
ar: حافلة
ka: მატარებელი

source: Connections
ar: الاتصالات
ka: კავშირები

source: Bus Splitter
ar: مُقسِّم الناقل
ka: სალტის გამყოფი

source: Size
ar: الحجم
ka: ზომა

source: Passive
ar: خامل
ka: პასიური

source: Capacitor
ar: مكثف
ka: კონდენსატორი

source: Capacitance
ar: سعة كهربية
ka: მოცულობა

source: Demultiplexer
ar: فاك التجميع
ka: დემულტიპლექსერი

source: Address Size
ar: حجم العنوان
ka: მისამართის ზომა

source: Gain
ar: الكسب
ka: გაძლიერება

source: Sources
ar: المصادر
ka: წყაროები

source: CCCS
ar: CCCS مصدر تيار مُتحكَّم فيه بالتيار

source: Current Controlled Current Source
ar: مصدر تيار مُتحكَّم فيه بالتيار
ka: დენით მართული დენის წყარო

source: CCVS
ar: CCVS مصدر جهد مُتحكَّم فيه بالتيار

source: Current Controlled Voltage Source
ar: مصدر جهد مُتحكَّم فيه بالتيار
ka: დენით მართული ვოლტაჟის წყარო

source: VCCS
ar: VCCS مصدر تيار مُتحكَّم فيه بالجهد

source: Voltage Controlled Current Source
ar: مصدر تيار مُتحكَّم فيه بالجهد
ka: ვოლტაჟით მართული დენის წყარო

source: VCVS
ar: VCVS مصدر جهد مُتحكَّم فيه بالجهد

source: Voltage Controlled Voltage Source
ar: مصدر جهد مُتحكَّم فيه بالجهد
ka: ვოლტაჟით მართული ვოლტაჟის წყარო

source: Logic
ar: المنطق
ka: ლოგიკური
