Repository: KDE/ktechlab
Catalog: po/*/ktechlab.po
Languages: ar, ka

source: Filter here...
ar: صفِّ هنا...
ka: გაფილტვრა...

source: Clear filter
ar: امسح المرشّح
ka: ფილტრის გასუფთავება

source: Enter space-separated terms to filter the component library.
ar: أدخل مصطلحات مفصولة بمسافات لترشيح مكتبة المكونات.
ka: შეიყვანეთ ჰარეთი გამოტოვებული პირობები კომპონენტების ბიბლიოთეკის გასაფილტრად.

source: Select a predefined component configuration from this list.
ar: اختر اضبط مكون مبدئياً من هذه القائمة.
ka: აირჩიეთ წინასწარ აღწერილი კომპონენტის კონფიგურაცია სიიდან.

source: This allows editing of advanced properties of the selected item(s). Right click on the picture of the item to set the orientation.
ar: يسمح هذا بتحرير الخصائص المتقدمة للعنصر (العناصر) المحددة. انقر بزر الفأرة الأيمن على صورة العنصر لضبط التوجه.
ka: ეს მონიშნული ელემენტების დამატებითი თვისებების ჩასწორების საშუალებას იძლევა. მარჯვენა წკაპი ელემენტის სურათზე, რომ მისი ორიენტაცია დააყენოთ.

source: <p>Shows properties associated with the currently selected item(s).<br/>Select a property to change its value. If multiple items are selected with different values then the property will appear greyed out, use "Merge Properties" to make them the same.<br/>Select "Defaults" to set all properties to their default values
ar: <p>أظهر الخصائص المرتبطة بالعنصر (العناصر) المحددة حاليًا. <br/>اختر خاصية لتغيير قيمتها. إذا اختيرت عناصر متعددة بقيم مختلفة فستظهر الخاصية باهتة، استخدم «دمج الخصائص» لجعلها متشابهة. <br/>اختر «مبدئيات» لضبط كل الخصائص على قيمها المبدئية
ka: <p>აჩვენებს თვისებებს, რომლებიც დაკავშირებულია ამჟამად არჩეულ ნივთ(ებ)თან.<br/>შეარჩიეთ ქონება მისი მნიშვნელობის შესაცვლელად. თუ მრავალი ელემენტი შეირჩევა სხვადასხვა მნიშვნელობებით, მაშინ ქონება გამოჩნდება ნაცრისფერი, გამოიყენეთ "შერწყმის თვისებები", რომ ისინი იგივე გახადონ.<br/>აირჩიეთ "ნაგულისხმევი", რომ დააყენოთ ყველა თვისება მათ ნაგულისხმევ მნიშვნელობებზე

source: Change the orientation of the selected item by selecting the appropriate button
ar: غيّر توجه العنصر المحدد باختيار الزر المناسب
ka: შეცვალეთ მონიშნული ელემენტის ორიენტაცია შესაბამისი ღილაკის არჩევით

source: Yes
ar: نعم
ka: დიახ

source: No
ar: لا
ka: არა

source: Property
ar: الخاصية
ka: პარამეტრი

source: Undo changes
ar: أرجع التغييرات
ka: ცვლილებების გაუქმება

source: Choose File
ar: اختر ملفّا...
ka: ფაილის არჩევა

source: Component
ar: المكون
ka: კომპონენტი

source: Remove %1
ar: أزِل %1
ka: %1-ის წაშლა

source: Add components to the circuit diagram by dragging them into the circuit.<br><br>To add more than one component of the same type, doubleclick on a component, and click repeatedly in the circuit to place the component. Right click to stop placement.<br><br>Some components (such as subcircuits) can be removed by right clicking on the item and selecting "Remove".
ar: أضف مكونات إلى رسم الدائرة بسحبها إلى الدائرة. <br><br>لإضافة أكثر من مكون واحد من نفس النوع، انقر نقرًا مزدوجًا على مكون، وانقر بشكل متكرر في الدائرة لوضع المكون. انقر بزر الفأرة الأيمن لإيقاف الوضع. <br><br>أستطيع إزالة بعض المكونات (كالدوائر الفرعية) بالنقر بزر الفأرة الأيمن على العنصر واختيار «إزالة».
ka: დაამატეთ კომპონენტები მიკროსქემის დიაგრამაზე, გადაიტანეთ ისინი წრეში.<br><br>იმავე ტიპის ერთზე მეტი კომპონენტის დასამატებლად, ორჯერ დააჭირეთ კომპონენტს და დააჭირეთ არაერთხელ წრეში, რომ მოათავსოთ კომპონენტი. მარჯვენა ღილაკით დააჭირეთ განთავსების შეჩერებას.<br><br>ზოგიერთი კომპონენტი (მაგალითად, ქვეცირკულაცია) შეიძლება ამოღებულ იქნას პუნქტზე მარჯვენა ღილაკით დაჭერით და "ამოღების" არჩევით.

source: Add FlowPart to the FlowCode document by dragging them there.<br><br>To add more than one FlowPart of the same type, doubleclick on a FlowPart, and click repeatedly in the FlowChart to place the component. Right click to stop placement.
ar: أضف FlowPart إلى وثيقة FlowCode بسحبها هناك. <br><br>لإضافة أكثر من FlowPart من نفس النوع، انقر نقرًا مزدوجًا على FlowPart، وانقر بشكل متكرر في المخطط الانسيابي لوضع المكون. انقر بزر الفأرة الأيمن لإيقاف الوضع.
ka: დაამატეთ FlowPart FlowCode დოკუმენტში მათი იქ გადატანით.<br><br>იმავე ტიპის ერთზე მეტი FlowPart- ის დასამატებლად, Doubleclick on FlowPart და დააჭირეთ განმეორებით FlowChart- ში კომპონენტის დასათავსებლად. მარჯვენა ღილაკით დააჭირეთ განთავსების შეჩერებას.

source: Flow Part
ar: جزء انسيابي
ka: დიაგრამის ნაწილები

source: Add mechanical parts to the mechanics work area by dragging them there.
ar: أضف الأجزاء الميكانيكية إلى مساحة عمل الميكانيكا بسحبها هناك.
ka: დაამატეთ მექანიკური ნაწილები მექანიკურ სამუშაო სივრცეს მათი გადათრევით.

source: Library Directory (-I):
ar: دليل المكتبة (-I):
ka: ბიბლიოთეკის საქაღალდე (-I):

source: &Output a map file (-m)
ar: &أخرِج ملف خريطة (-m)
ka: რუკის ფაილის გამ&ოტანა (-m)

source: Linker Script (-s):
ar: سكربت الرابط (-s):
ka: ლინკერის სკრიპტი (-s):

source: Other:
ar: أخرى:
ka: სხვა:

source: Link libraries inside project
ar: وصل المكتبات داخل المشروع
ka: ბიბლიოთეკების მიბმა პროექტში

source: Logic Symbol Shapes:
ar: أشكال رموز المنطق:
ka: ლოგიკური სიმბოლოს ფორმები:

source: Distinctive
ar: مميز
ka: განმასხვავებელი

source: Rectangular
ar: مستطيل
ka: მართკუთხედი

source: Input
ar: الدّخل
ka: შეყვანა

source: Required voltage level before the input will be considered high.
ar: مستوى الجهد المطلوب قبل اعتبار الإدخال عاليًا.
ka: აუცილებელი ძაბვის დონე, სანამ შეყვანა მაღლად ჩაითვლება.

source: V
ar: فولت

source: Required voltage level before an input will be considered low.
ar: مستوى الجهد المطلوب قبل اعتبار الإدخال منخفضًا.
ka: აუცილებელი ძაბვის დონე, სანამ შეყვანა დაბლად ჩაითვლება.

source: Falling Trigger Threshold:
ar: عتبة تشغيل الهبوط:
ka: გადამრთველის გამორთვის ზღვარი:

source: Rising Trigger Threshold:
ar: عتبة تشغيل الارتفاع:
ka: გადამრთველის ჩართვის ზღვარი:

source: Voltage level for high on logic components.
ar: مستوى الجهد العالي لمكونات المنطق.
ka: ძაბვის დონე ლოგიკური კომპონენტების ჩასართავად.

source: Output High:
ar: الإخراج العالي:
ka: გამოტანის ჩართვა:

source: This is the output impedance when the output is high.
ar: هذه هي مقاومة الإخراج عند ارتفاع الإخراج.
ka: ეს გამოტანის იმპედანსია, როცა გამოტანა მაღალია.

source: High Output Impedance:
ar: مقاومة الإخراج العالية:
ka: იმპედანსი გამოყვანის მაღალ დონეზე:

source: This is the output impedance when the output is low.
ar: هذه هي مقاومة الإخراج عند انخفاض الإخراج.
ka: ეს გამოტანის იმპედანსია, როცა გამოტანა დაბალია.

source: Low Output Impedance:
ar: مقاومة الإخراج المنخفضة:
ka: დაბალი გამოყვანის იმპედანსი:

source: Floating
ar: عائم
ka: მცურავი

source: Here, you can configure the behaviour of logic components. These values will apply to all components, apart from the PIC, whose pins' impedances depend on the pin in use.
ar: هنا، أستطيع أن اضبط سلوك مكونات المنطق. ستنطبق هذه القيم على كل المكونات، باستثناء PIC، التي تعتمد مقاومة دبابيسها على الدبوس المستخدَم.
ka: აქ შეგიძლიათ ლოგიკური კომპონენტების ქცევა მოირგოთ. ეს მნიშვნელობები ეხება ყველა კომპონენტს PIC-ის გარდა, რომლის კონტაქტების იმპედანსი დამოკიდებულია იმაზე, რომელ კონტაქტს იყენებთ.

source: Clear All
ar: امحُ الكلّ
ka: ყველას გასუფთავება

source: Microprocessor
ar: معالج دقيق
ka: მიკროპროცესორი

source: Family
ar: العائلة
ka: ოჯახი

source: Micro
ar: ميكرو
ka: მიკრო

source: PIC Settings
ar: إعدادات PIC
ka: PIC -ის მორგება

source: This dialog allows editing of the initial properties of the PIC
ar: يسمح هذا الحوار بتحرير الخصائص المبدئية لـ PIC
ka: ეს დიალოგი PIC-ის საწყისი თვისებების ჩასწორების საშუალებას გაძლევთ

source: Edit the initial value of the ports here. For each binary number, the order from right-to-left is pins 0 through 7.<br><br>The "Type (TRIS)" edit shows the initial input/output state of the ports; 1 represents an input, and 0 an output.<br><br>The "State (PORT)" edit shows the initial high/low state of the ports; 1 represents a high, and 0 a low.
ar: حرّر القيمة المبدئية للمنافذ هنا. لكل رقم ثنائي، التسلسل من اليمين إلى اليسار هو الدبابيس من 0 حتى 7. <br><br>حرّر «النوع (TRIS)» يُظهر حالة الإدخال/الإخراج المبدئية للمنافذ؛ يمثل 1 مدخلًا، و 0 مخرجًا. <br><br>حرّر «الحالة (PORT)» يُظهر حالة الارتفاع/الانخفاض المبدئية للمنافذ؛ يمثل 1 ارتفاعًا، و 0 انخفاضًا.
ka: შეცვალეთ პორტების საწყისი მნიშვნელობა აქ. თითოეული ორობითი ნომრისთვის, მარჯვნივ მარცხნივ შეკვეთა არის ქინძისთავები 0-დან 7-მდე.<br><br>"ტიპი (TRIS)" რედაქტირება გვიჩვენებს პორტების საწყის შეყვანას/გამომავალ მდგომარეობას; 1 წარმოადგენს შეყვანას და 0 გამომავალს.<br><br>"სახელმწიფო (PORT)" რედაქტირება აჩვენებს პორტების საწყის მაღალ/დაბალ მდგომარეობას; 1 წარმოადგენს მაღალს და 0 დაბალი.

source: Edit the initial value of the variables here.<br><br>Note that the value of the variable can only be in the range 0->255. These variables will be initialized before any other code is executed.
ar: حرّر القيمة المبدئية للمتغيرات هنا. <br><br>لاحظ أن قيمة المتغير لا أستطيع أن تكون إلا في النطاق 0->255. ستتم تهيئة هذه المتغيرات قبل تنفيذ أي شفرة أخرى.
ka: შეცვალეთ ცვლადების საწყისი მნიშვნელობა აქ.<br><br>გაითვალისწინეთ, რომ ცვლადის მნიშვნელობა შეიძლება იყოს მხოლოდ 0->255 დიაპაზონში. ეს ცვლადები ინიციალიზებული იქნება ნებისმიერი სხვა კოდის შესრულებამდე.

source: Type (TRIS register):
ar: النوع (سجل TRIS):
ka: ტიპი (TRIS რეგისტრი):

source: State (PORT register):
ar: الحالة (سجل PORT):
ka: მდგომარეობა (PORT რეგისტრი):

source: Variable name
ar: اسم المتغير
ka: ცვლადის სახელი

source: Variable value
ar: قيمة المتغير
ka: ცვლადის მნიშვნელობა

source: New Pin Mapping
ar: تعيين دبوس جديد
ka: ახალი კონტაქტების ასახვა

source: Create
ar: أنشئ
ka: შექმნა

source: New Pin Map Name
ar: اسم خريطة دبوس جديدة
ka: ახალი კონტაქტების რუკის სახელი

source: Invalid variable value: %1
ar: قيمة متغير غير صالحة: %1
ka: არასწორი ცვლადის მნიშვნელობა: %1

source: Tip: Toggle the initial state (high/low) of a pin by clicking its picture. Drag it to set the type (input/output).
ar: تلميح: بدّل الحالة المبدئية (عالية/منخفضة) للدبوس بالنقر على صورته. اسحبه لضبط النوع (إدخال/إخراج).
ka: რჩევა: პინის საწყისი მდგომარეობის (მაღალი/დაბალი) გადართვა მის სურათზე დაჭერით. გადაიტანეთ იგი ტიპის დასადგენად (შეყვანა / გამომავალი).

source: Remove
ar: أزل
ka: წაშლა

source: Modif&y
ar: &عدّل
ka: &შეცვლა

source: Rename
ar: غيّر الاسم
ka: სახელის გადარქმევა

source: New File
ar: ملفّ جديد
ka: ახალი ფაილი

source: Select the type of file you wish to create.<br> <p> <b>Pic Program</b><br> Creates a new PIC program, with flow chart editor. Select the target device for your program below. <p> <b>Circuit</b><br> Creates a new circuit, with drag and drop editor. Real time simulation of the circuit occurs automatically.
ar: اختر نوع الملف الذي ترغب في إنشائه. <br> <p> <b>برنامج Pic</b><br> أنشئ برنامج PIC جديدًا، مع محرر مخطط انسيابي. اختر جهاز الهدف لبرنامجك أدناه. <p> <b>دائرة</b><br> أنشئ دائرة جديدة، مع محرر سحب وإفلات. يحدث محاكاة الدائرة في الوقت الفعلي آليًا.
ka: აირჩიეთ ფაილის ტიპი, რომლის შექმნაც გსურთ.<br> <p> <b>Pic პროგრამა</b><br>ქმნის ახალ PIC პროგრამას, ნაკადის დიაგრამის რედაქტორით. აირჩიეთ სამიზნე მოწყობილობა თქვენი პროგრამისთვის ქვემოთ.<p> <b>Circuit</b><br>ქმნის ახალ წრეს, გადათრევით და ჩამოშვების რედაქტორით. მიკროსქემის რეალურ დროში სიმულაცია ხდება ავტომატურად.

source: New File Details
ar: تفاصيل الملف الجديد
ka: ახალი ფაილის დეტალები

source: File Type:
ar: نوع الملف:
ka: ფაილის ტიპი:

source: &Add to project
ar: أ&ضف إلى المشروع
ka: &პროექტისთვის დამატება

source: Name:
ar: الاسم:
ka: სახელი:

source: The variable name of the pin mapping - this must be a valid Microbe variable name.
ar: اسم المتغير لتعيين الدبوس - يجب أن يكون هذا اسم متغير Microbe صالحًا.
ka: კონტაქტების რუკის ცვლადის სახელი - ეს სწორი Microbe-ის ცვლადის სახელი უნდა იყოს.

source: Keypad (4x3)
ar: لوحة مفاتيح (4x3)
ka: ციფრული კლავიატურა (4x3)

source: Keypad (4x4)
ar: لوحة مفاتيح (4x4)
ka: ციფრული კლავიატურა (4x4)

source: Final location:
ar: الموقع النهائي:
ka: საბოლოო მდებარეობა:

source: Location:
ar: الموقع:
ka: მდებარეობა:

source: New Project Details
ar: تفاصيل المشروع الجديد
ka: ახალი პროექტის დეტალები

source: Project Name:
ar: اسم المشروع:
ka: პროექტის სახელი:

source: Oscilloscope
ar: راسم إشارة
ka: ოსცილოსკოპი

source: Framerate
ar: معدّل الإطارات
ka: კადრების სიჩქარე

source: %1 fps
ar: %1 إطار/ثا
ka: %1 კადრი/წმ

source: Time Zoom
ar: تكبير الزمن
ka: დროის გადიდება

source: Displa&y directly
ar: اعرض &مباشرةً
ka: &პირდაპირ ჩვენება

source: Sa&ve to file
ar: ا&حفظ في ملفّ
ka: &ფაილში შენახვა

source: Load File in &New View
ar: حمِّل الملف في عرض &جديد
ka: ფაილის გახს&ნა ახალ ხედში

source: &Add to Project
ar: أ&ضف إلى المشروع
ka: &პროექტისთვის დამატება

source: &Add ...
ar: أ&ضف ...
ka: &დამატება ...

source: Re&move
ar: أ&زل
ka: წა&შლა

source: Program:
ar: البرنامج:
ka: პროგრამა:

source: (Program Description)
ar: (وصف البرنامج)
ka: (პროგრამის აღწერა)

source: Initialization:
ar: التهيئة:
ka: ინიციალიზაცია:

source: Read:
ar: قراءة:
ka: კითხვა:

source: Write:
ar: كتابة:
ka: ჩაწერა:

source: The following strings will be replaced when the command is run: <ul> <li><b>%port</b> - Port that the programmer is connected to</li> <li><b>%device</b> - PIC device</li> <li><b>%file</b> - File to read from or write to</li> </ul>
ar: استبدِل السلاسل التالية عند تشغيل الأمر: <ul> <li><b>%port</b> - المنفذ المتصل به المبرمج</li> <li><b>%device</b> - جهاز PIC</li> <li><b>%file</b> - الملف للقراءة منه أو الكتابة إليه</li> </ul>
ka: ბრძანების გაშვებისას ჩანაცვლება შემდეგი სტრიქონები: <ul> <li><b>%port</b> - პორტი, რომელზეც პროგრამატორია მიერთებული</li> <li><b>%device</b> - PIC მოწყობილობა</li> <li><b>%file</b> - წასაკთხი, ან ჩასაწერი ფაილი</li> </ul>

source: Erase:
ar: امسح:
ka: წაშლა:

source: Verify:
ar: تحقق:
ka: შემოწმება:

source: Blank Check:
ar: افحص الفراغ:
ka: სიცარიელეზე შემოწმება:

source: Default port:
ar: منفذ مبدئي:
ka: ნაგულისხმევი პორტი:

source: Output File:
ar: ملف الخرج:
ka: გამოტანის ფაილი:

source: PIC Programmer
ar: مبرمج PIC
ka: PIC-ის პროგრამატორი

source: Burn
ar: حرق
ka: CD-ზე ჩაწერა

source: New Project
ar: مشروع جديد
ka: ახალი პროექტი

source: Create Subproject
ar: أنشئ مشروعًا فرعيًا
ka: ქვეპროექტის შექმნა

source: Linker Options
ar: خيارات الرابط
ka: მიმბმელის მორგება

source: Processing Options
ar: خيارات المعالجة
ka: დამუშავების მორგება

source: Bold
ar: ثخين
ka: გასქელება

source: Italic
ar: مائل
ka: დახრა

source: Underline
ar: تسطير
ka: ხაზგასმული

source: List
ar: قائمة
ka: სია

source: Text Alignment
ar: محاذاة النص
ka: ტექსტის გასწორება

source: Align Left
ar: حاذِ يسارًا
ka: მარცხნივ სწორება

source: Align Center
ar: حاذِ وسطًا
ka: ცენტრზე სწორება

source: Align Right
ar: حاذِ يمينًا
ka: მარჯვნივ სწორება

source: Align Block
ar: حاذِ إلى الكتلة
ka: ბლოკის სწორება

source: Text Vertical Alignment
ar: محاذاة النص العمودية
ka: ტექსტის ვერტიკალური სწორება

source: Superscript
ar: مرتفع
ka: ზედა ხაზზე

source: Normal
ar: عادي
ka: ჩვეულებრივი

source: Subscript
ar: منخفض
ka: ქვედა ხაზზე

source: Text Color...
ar: لون النّصّ...
ka: ტექსტის ფერი...

source: X
ar: س

source: Intervals
ar: مسافات
ka: ინტერვალები

source: Ticks per Interval
ar: النقر لكل فترة
ka: ტაქტი თითო ინტერვალზე

source: Offset (ticks)
ar: الإزاحة (نقرات)
ka: წანაცვლება (ტაქტი)

source: Ge&neral
ar: عامّ
ka: &ზოგადი

source: Do not search in the standard librar&y directory (--nostdlib)
ar: لا تبحث في دليل المكت&بة القياسي (--nostdlib)
ka: სტანდარტუ&ლი ბიბლიოთეკის საქაღალდეში ძებნა არ მოხდება (--nostdlib)

source: Do not search in the standard include directory (--nostdinc)
ar: لا تبحث في دليل التضمين القياسي (--nostdinc)
ka: სტანდარტული ჩასმის საქაღალდეში ძებნა არ მოხდება (--nostdinc)

source: Disa&ble pedantic warnings (--less-pedantic)
ar: ع&طّل التحذيرات المتحذلقة (--less-pedantic)
ka: პედანტური გაფრთხილე&ბების გამორთვა (--less-pedantic)

source: Follow the C89 standard and disable SDCC features that conflict with the standard.
ar: اتبع معيار C89 وعطّل ميزات SDCC التي تتعارض مع المعيار.
ka: C89 სტანდარტის მიყოლა და SDCC-ის იმ ფუნქციების გამორთვა, რომლებიც სტანდარტს ეწინააღმდეგება.

source: Use C&89 standard only (--std-c89)
ar: استخدم معيار C&89 فقط (--std-c89)
ka: მხოლოდ C&89 სტანდარტის გამოყენება (--std-c89)

source: Follow the C99 standard and disable SDCC features that conflict with the standard (incomplete support).
ar: اتبع معيار C99 وعطّل ميزات SDCC التي تتعارض مع المعيار (دعم غير مكتمل).
ka: C99 სტანდარტის მიყოლა და SDCC-ის იმ ფუნქციების გამორთვა, რომლებიც სტანდარტს ეწინააღმდეგება. (მხარდაჭერა არასრულია).

source: Use C&99 standard only (--std-c99)
ar: استخدم معيار C&99 فقط (--std-c99)
ka: მხოლოდ C&99 სტანდარტის გამოყენება (--std-c99)

source: Use non-free licensed libraries and header files (--use-non-free)
ar: استخدم المكتبات وملفات الترويسة غير المرخصة ترخيصًا حرًا (--use-non-free)
ka: არათავისუფალი ლიცენზიის მქონე ბიბლიოთეკებისა და თავსართი ფაილების ძებნა / ჩასმა (--use-non-free)

source: Code Gener&ation
ar: &توليد الشيفرة
ka: კოდის გენერ&აცია

source: All functions in the source file will be compiled as reentrant, i.e. the parameters and local variables will be allocated on the stack. If this option is used all source files in the project should be compiled with this option. It automatically implies --int-long-reent and --float-reent.
ar: اجمع جميع الدوال في ملف المصدر على أنها قابلة لإعادة الدخول، أي خصِّص البارامترات والمتغيرات المحلية على المكدس. إذا استخدمت هذا الخيار، اجمع جميع ملفات المصدر في المشروع بهذا الخيار. إنه يتضمن آليًا --int-long-reent و --float-reent.
ka: წყაროს ფაილში ყველა ფუნქცია შედგენილი იქნება როგორც reentrant, ე.ი. პარამეტრები და ადგილობრივი ცვლადები გამოიყოფა დასტის დროს. თუ ეს ვარიანტი გამოიყენება პროექტში ყველა წყაროს ფაილი უნდა იყოს შედგენილი ამ ვარიანტით. ეს ავტომატურად გულისხმობს --int-long-reent და --float-reent.

source: Stack auto&matic variables (--stack-auto)
ar: ك&دس المتغيرات الآلية (--stack-auto)
ka: ავტო&მატური ცვლადების სტეკში განლაგება (--stack-auto)

source: Integer (16 bit) and long (32 bit) libraries have been compiled as reentrant. Note by default these libraries are compiled as non-reentrant.
ar: جمعت مكتبات الأعداد الصحيحة (16 بت) والطويلة (32 بت) على أنها قابلة لإعادة الدخول. لاحظ أنه افتراضًا تجمع هذه المكتبات على أنها غير قابلة لإعادة الدخول.
ka: მთელრიცხვიანი (16-ბიტიანი) და გრძელი (32-ბიტიანი) ბიბლიოთეკები მეორედ ჩატვირთვადადაა აგებული. დაიმახსოვრეთ, რომ ნაგულისხმევად ამ ბიბლიოთეკების აგება მეორედ ჩატვირთვადად აგებული არაა.

source: Integer li&braries were compiled as reentrant (--int-long-reent)
ar: جُمعت م&كتبات الأعداد الصحيحة على أنها قابلة لإعادة الدخول (--int-long-reent)
ka: მთელი რიცხვის &ბიბლიოთეკები აგებულია როგორც მეორედ ჩატვირთვადი (--int-long-reent)

source: Floating point library is compiled as reentrant.
ar: جُمعت مكتبة الفاصلة العائمة على أنها قابلة لإعادة الدخول.
ka: მცურავრიცხვიანი ბიბლიოთეკა აგებულია მეორადი ჩატვირთვისთვის.

source: Floating point librar&y was compiled as reentrant (--float-reent)
ar: جُمعت مكتبة الفاصلة العائمة &على أنها قابلة لإعادة الدخول (--float-reent)
ka: მცურავრიც&ხვიანი ბიბლიოთეკა აგებულია მეორადი ჩატვირთვისთვის (--float-reent)

source: Leave out the frame pointer (--fommit-frame-pointer)
ar: احذف مؤشر الإطار (--fommit-frame-pointer)
ka: ჩარჩოზე მაჩვენებლის გამოტოვება (--fommit-frame-pointer)

source: Will not memcpy initialized data from code space into xdata space. This saves a few bytes in code space if you do not have initialized data.
ar: لا تنسخ الذاكرة المبدئية للبيانات من مساحة التعمية إلى مساحة xdata. هذا يوفر بضعة بايتات في مساحة التعمية إذا لم تكن لديك بيانات مبدئية.
ka: არ იქნება memcpy ინიციალიზებული მონაცემები კოდის სივრციდან xdata სივრცეში. ეს დაზოგავს რამდენიმე ბაიტს კოდის სივრცეში, თუ არ გაქვთ ინიციალიზებული მონაცემები.

source: Do not memcpy initialized &xram from code (--no-xinit-opt)
ar: لا تنسخ الذاكرة المبدئية &xram من التعمية (--no-xinit-opt)
ka: ინიციალიზებული &xram-ის კოდიდან memcpy არ მოხდება (--no-xinit-opt)

source: Callee will &always save registers used (--all-callee-saves)
ar: المستدعَي &يحفظ دائمًا السجلات المستخدَمة (--all-callee-saves)
ka: გამოძახებული ყოველთვის ინ&ახავს გამოყენებულ რეგისტრებს (--all-callee-saves)

source: &Optimization
ar: &تحسين
ka: &ოპტიმიზაცია

source: The compiler will not overlay parameters and local variables of any function, see section Parameters and local variables for more details.
ar: لا يركب المجمّع البارامترات والمتغيرات المحلية لأي دالة، انظر قسم البارامترات والمتغيرات المحلية لمزيد من التفاصيل.
ka: კომპილატორი არც ერთი ფუნქციის პარამეტრებს და ლოკალურ ცვლადებს გადაალაგებს. მეტი დეტალებისთვის იხილეთ პარამეტრების და ლოკალური ცვლადების სექცია.

source: Disable overlaying leaf function &auto variables (--nooverlay)
ar: عطّل تركيب المتغيرات الآ&لية للدوال الورقية (--nooverlay)
ka: ფოთოლი ფ&უნქციების ავტოცვლადების გადალაგება არ მოხდება (--nooverlay)

source: Disable the GCSE optimization (--nogcse)
ar: عطّل تحسين GCSE (--nogcse)
ka: GCSE ოპტიმიზაციის გამორთვა (--nogcse)

source: Will not optimize labels (makes the dumpfiles more readable).
ar: لا يحسّن اللصائق (يجعل ملفات التفريغ أكثر قابلية للقراءة).
ka: ჭდეების ოპტიმიზაცია არ მოხდება (დამპის ფაილი უფრო წაკთხვადი გახდება).

source: Disable label optimi&zation (--nolabelopt)
ar: عطّل تحسين ال&لصائق (--nolabelopt)
ka: ჭდის ოპტიმი&ზაციის გამორთვა (--nolabelopt)

source: Disable optimization of invariants (--noinvariant)
ar: عطّل تحسين الثوابت (--noinvariant)
ka: მუდმივი მნიშვნელობების ოპტიმიზაციის გამორთვა (--noinvariant)

source: Disable loop variable induction (--noinduction)
ar: عطّل تحريض متغير الحلقة (--noinduction)
ka: ციკლის ცვლადების ინდუქციის გამორთვა (--noinduction)

source: Disable peep-hole optimization.
ar: عطّل تحسين ثقب النظر.
ka: პირდაპირი წვდომის ოპტიმიზაციის გამორთვა.

source: Disable peep-hole optimization (--&no-peep)
ar: عطّل تحسين ثقب النظر (--&no-peep)
ka: პირდაპირი წვდომის ოპტიმიზაციის გამორთვა (--&no-peep)

source: Will not do loop reversal optimization.
ar: لا ينجز تحسين عكس الحلقة.
ka: მარყუჟის რევერსის ოპტიმიზაციის გამორთვა.

source: Disable loop reverse optimization (--noloopreverse)
ar: عطّل تحسين عكس الحلقة (--noloopreverse)
ka: პირდაპირი წვდომის ოპტიმიზაციის გამორთვა (--noloopreverse)

source: The compiler will optimize code generation towards compact code, possibly at the expense of code speed.
ar: يحسّن المجمّع توليد التعمية باتجاه تعمية مضغوطة، ربما على حساب سرعة التعمية.
ka: კომპილატორი მოახდენს ოპტიმიზაციას, რომ მიღებული კოდი რაც შეიძლება, პატარა იყოს, კოდის სიჩქარის ხარჯზეც კი.

source: Opti&mize for compact code (--opt-code-size)
ar: حسّن من &أجل تعمية مضغوطة (--opt-code-size)
ka: კომპაქტური კოდისთვის ოპტი&მიზაცია (--opt-code-size)

source: The compiler will optimize code generation towards fast code, possibly at the expense of code size.
ar: يحسّن المجمّع توليد التعمية باتجاه تعمية سريعة، ربما على حساب حجم التعمية.
ka: კომპილატორი მოახდენს ოპტიმიზაციას, რომ მიღებული კოდი რაც შეიძლება, სწრაფი იყოს, კოდის ზომის ხარჯზეც კი.

source: &Optimize for fast code (--opt-code-speed)
ar: حسّن من أ&جل تعمية سريعة (--opt-code-speed)
ka: სწრაფი კოდისთვის &ოპტიმიზაცია (--opt-code-speed)

source: Pass the inline assembler code through the peep hole optimizer. This can cause unexpected changes to inline assembler code, please go through the peephole optimizer rules defined in the source file tree '<target>/peeph.def' before using this option.
ar: مرر تعمية المجمع المضمّنة عبر محسّن ثقب النظر. هذا قد يسبب تغييرات غير متوقعة في تعمية المجمع المضمّنة، رجاءً راجع قواعد محسّن ثقب النظر المعرّفة في شجرة ملف المصدر '<target>/peeph.def' قبل استخدام هذا الخيار.
ka: გაიარეთ ინლაინ ასამბლეის კოდი peep ხვრელის ოპტიმიზატორის საშუალებით. ამან შეიძლება გამოიწვიოს მოულოდნელი ცვლილებები ინლაინ ასამბლეის კოდში, გთხოვთ, გაიაროთ peephole ოპტიმიზატორის წესები, რომლებიც განსაზღვრულია წყაროს ფაილის ხეში '<target>/peeph.def' ამ ვარიანტის გამოყენებამდე.</target>.

source: Ena&ble inline assembly peephole optimization (--peep-asm)
ar: ف&عّل تحسين ثقب النظر لتجميع السطر (--peep-asm)
ka: ხაზშივე წვდომის წერტილის ასამ&ბლერული ოპტიმიზაციის ჩართვა (--peep-asm)

source: Do not generate boundary check for &jump tables (--nojtbound)
ar: لا تولّد فحص حدود ل&جداول القفز (--nojtbound)
ka: არ მოხდება გადასვლის ზღვრების შემოწმება გადასვლის ც&ხრილებისთვის (--nojtbound)
