Repository: KDE/ktechlab
Catalog: po/*/ktechlab.po
Languages: ar, ka

source: Inverter
ar: عاكس
ka: ინვერტორი

source: Buffer
ar: المؤقتة
ka: ბaფერი

source: Logic Input
ar: إدخال منطقي
ka: ლოგიკური შეყვანა

source: Use Toggle
ar: اسْتَخْدِمْ المفتاح المتبادل
ka: გადართვა

source: Logic Output
ar: إخراج منطقي
ka: ლოგიკური გამოყვანა

source: BCD to 7 Segment
ar: العشري المرمّز بالثنائي إلى عارض ذي 7 قطع
ka: BCD-დან 7 სეგმენტამდე

source: BCD to Seven Segment
ar: BCD إلى سبعة مقاطع
ka: BCD-დან შვიდ სეგმენტამდე

source: Discrete
ar: منفصلة
ka: დისკრეტული

source: NPN Transistor
ar: ترانزستور NPN
ka: NPN ტრანზისტორი

source: PNP Transistor
ar: ترانزستور PNP
ka: PNP ტრანზისტორი

source: Saturation Current
ar: تيار التشبع
ka: გაჯერებულობის დენი

source: Forward Coefficient
ar: المعامل الأمامي
ka: პირდაპირი კოეფიციენტი

source: Reverse Coefficient
ar: المعامل العكسي
ka: უკუკოეფიციენტი

source: Forward Beta
ar: بيتا الأمامي
ka: პირდაპირი ბეტა

source: Reverse Beta
ar: بيتا العكسي
ka: უკუღმა ბეტა

source: Clock Input
ar: إدخال الساعة
ka: ტაქტური შეყვანა

source: Low Time
ar: وقت الانخفاض
ka: დაბალი პერიოდი

source: High Time
ar: وقت الارتفاع
ka: მაღალი პერიოდი

source: Current Signal
ar: إشارة التيار
ka: დენის სიგნალი

source: Frequency
ar: التردّد
ka: სიხშირე

source: Current Range
ar: نطاق التيار
ka: დენის შუალედი

source: Current Source
ar: مصدر التيار
ka: დენის წყარო

source: Current
ar: التيار
ka: მიმდინარე

source: Diode
ar: ثنائي المساري
ka: დიოდი

source: Emission Coefficient
ar: معامل الانبعاث
ka: გამოსხივების კოეფიციენტი

source: Breakdown Voltage
ar: جهد الانهيار
ka: გამრღვევი ძაბვა

source: Fixed Voltage
ar: جهد ثابت
ka: ფიქსირებული ძაბვა

source: Voltage
ar: الجهد
ka: Ვოლტაჟი

source: Ground (0V)
ar: أرضي (0 فولت)
ka: დამიწება (0V)

source: Ground
ar: أرضي
ka: დამიწება

source: N-Channel JFET
ar: JFET بقناة N
ka: N-არხიანი JFET

source: P-Channel JFET
ar: JFET بقناة P
ka: P-არხიანი JFET

source: Threshold voltage
ar: جهد العتبة
ka: ზღვრული ვოლტაჟი

source: Transcondutance
ar: الموصلية التبادلية
ka: გამტარობა

source: Saturation current
ar: تيار التشبع
ka: გაჯერებულობის დენი

source: PN emission coefficient
ar: معامل انبعاث PN
ka: PN გამოსხივების კოეფიციენტი

source: Isr emission coefficient
ar: معامل انبعاث Isr
ka: Isr გამოსხივების კოეფიციენტი

source: Keypad
ar: لوحة المفاتيح
ka: ციფრული კლავიატურა

source: Switches
ar: مفاتيح تبديل
ka: გადამრთველები

source: Use Toggles
ar: اسْتَخْدِمْ المفاتيح المتبادلة
ka: გადამრთველების გამოყენება

source: Columns
ar: الأعمدة
ka: სვეტები

source: n-d MOSFET
ar: الموسفت n-d

source: p-d MOSFET
ar: الموسفت p-d

source: N-Channel Enhancement MOSFET
ar: الموسفت التعزيزي بقناة N
ka: N-არხის გამაძლიერებელი MOSFET

source: P-Channel Enhancement MOSFET
ar: الموسفت التعزيزي بقناة P
ka: P-არხის გამაძლიერებელი MOSFET

source: N-Channel Depletion MOSFET
ar: الموسفت النضوبي بقناة N
ka: N-არხის დასუსტების MOSFET

source: P-Channel Depletion MOSFET
ar: الموسفت النضوبي بقناة P
ka: P-არხის დასუსტების MOSFET

# mosfet body/bulk pin
source: Body Pin
ar: دبوس الجسم
ka: ბაზის კონტაქტი

source: Op Amp
ar: مضخم العمليات
ka: ოპერაციული გამაძლიერებელი

source: Operational Amplifier
ar: مضخم عملياتي
ka: ოპერაციული გამაძლიერებელი

source: Potentiometer
ar: مقياس الجهد الانزلاقي
ka: პოტენციომეტრი

source: Resistance
ar: المقاومة
ka: წინაღობა

source: Seven Segment
ar: سبعة مقاطع
ka: შვიდი სეგმენტი

source: Seven Segment LED
ar: سبعة مقاطع LED
ka: შვიდსეგმენტიანი LED

source: Color
ar: اللون
ka: ფერი

source: Configuration
ar: الضّبط
ka: გამართვა

source: Common Cathode
ar: مهبط مشترك
ka: საერთო აკათოდი

source: Common Anode
ar: مصعد مشترك
ka: საერთო ანოდი

source: Signal Lamp
ar: مصباح الإشارة
ka: სიგნალის ნათურა

source: Subcircuit
ar: دائرة فرعية
ka: ქვეწრედი

source: Voltage Signal
ar: إشارة الجهد
ka: ვოლტაჟის სიგნალი

source: Voltage Range
ar: نطاق الجهد
ka: ვოლტაჟის დიაპაზონი

source: Output
ar: الخرج
ka: გამოტანა

source: Peak
ar: الذروة
ka: პიკი

source: RMS
ar: جذر متوسط المربعات

source: Battery
ar: البطارية
ka: ელემენტი

source: External Connection
ar: توصيل خارجي
ka: გარე მიერთება

source: Name
ar: الاسم
ka: სახელი

source: D Flip-Flop
ar: قلاب D
ka: D ტრიგერი

source: D-Type Flip-Flop
ar: قلاب من نوع D
ka: D-ტიპის ტრიგერი

source: JK Flip-Flop
ar: قلاب JK
ka: JK ტრიგერი

source: JK-Type Flip-Flop
ar: قلاب من نوع JK
ka: JK-ტიპის ტრიგერი

source: SR Flip-Flop
ar: قلاب SR
ka: SR ტრიგერი

source: Adder
ar: جامع منطقي
ka: შემკრები

source: Inductor
ar: محث
ka: ინდუქციური კოჭა

source: Inductance
ar: محاثة
ka: ინდუქციურობა

source: Bar Graph Display
ar: عرض الرسم البياني الشريطي
ka: ჰისტოგრამის ჩვენება

source: Rows
ar: الصفوف
ka: სტრიქონები

source: Magnitude Comparator
ar: مقارن المقدار
ka: ციფრული მონაცემების შედარების ბლოკი

source: Number Inputs
ar: عدد المدخلات
ka: შეყვანების რაოდენობა

source: Matrix Display
ar: شاشة مصفوفة
ka: მატრიცული ეკრანი

source: Row Cathode
ar: مهبط الصف
ka: მწკრივის კათოდი

source: Column Cathode
ar: مهبط العمود
ka: სვეტის კათოდი

source: Matrix Display Driver
ar: مشغل شاشة المصفوفة
ka: მატრიცული ეკრანის დრაივერი

source: Minimum Value
ar: أقل قيمة
ka: მინიმალური მნიშვნელობა

source: Maximum Value
ar: القيمة القصوى
ka: მაქსიმალური მნიშვნელობა

source: Frequency Meter (TODO)
ar: مقياس التردد (قيد التنفيذ)
ka: სიხშირესაზომი

source: Frequency Meter
ar: مقياس التردد
ka: სიხშირესაზომი

source: Ammeter
ar: مقياس التيار الكهربائي
ka: ამპერმეტრი

source: Voltmeter
ar: مقياس جهد كهربائي
ka: ვოლტმეტრი

source: XNOR gate
ar: بوابة اختيار حصري سالبة
ka: ლოგიკური ელემენტი XNOR

source: XOR gate
ar: بوابة فصل إقصائي
ka: ლოგიკური ელემენტი 'არა-ან'

source: OR gate
ar: بوابة أو
ka: ლოგიკური ელემენტი 'ან'

source: NOR gate
ar: بوابة NOR
ka: ლოგიკური ელემენტი 'არ-ან'

source: NOR Gate
ar: بوابة NOR
ka: ლოგიკური ელემენტი NOR

source: NAND gate
ar: بوابة NAND
ka: ლოგიკური ელემენტი 'არა და'

source: NAND Gate
ar: بوابة NAND
ka: ლოგიკური ელემენტი NAND

source: AND gate
ar: بوابة و
ka: ლოგიკური ელემენტი 'და'

source: AND Gate
ar: بوابة و
ka: ლოგიკური ელემენტი AND

source: Multiplexer
ar: مضاعف الإرسال
ka: მულტიპლექსორი

source: Parallel Port
ar: المنفذ المتوازيّ
ka: პარალელური პორტი

source: Port
ar: المنفذ
ka: პორტი

source: Could not open port %1
ar: لم أستطع فتح المنفذ %1
ka: ვერ გავხსენი პორტი %1

source: PIC Micro
ar: ميكرو PIC
ka: PIC მიკროკონტროლერი

source: <Enter location of PIC Program>
ar: <أدخل موقع برنامج PIC>
ka: <შეიყვანეთ PIC-ის პროგრამის მდებარეობა>

source: Program
ar: البرنامج
ka: პროგრამა

source: All Supported Files
ar: كلّ الملفّات المتاحة
ka: ყველა მხარდაჭერილი ფაილი

source: Symbol File
ar: ملف الرمز
ka: სიმბოლოს ფაილი

source: Assembly Code
ar: شفرة التجميع
ka: ასამბლერის კოდი

source: C Code
ar: شفرة C
ka: C კოდი

source: The file "%1" does not exist.
ar: الملفّ "%1" غير موجود.
ka: ფაილი '%1' არ არსებობს.

source: "%1" is not a valid PIC program. The file must exist, and the extension should be ".cod", ".asm", ".flowcode", ".basic", ".microbe" or ".c". ".hex" is allowed, provided that there is a corresponding ".cod" file.
ar: «%1» ليس برنامج PIC صالحًا. يجب أن يتواجد الملف، ويجب أن يكون الامتداد «.cod» أو «.asm» أو «.flowcode» أو «.basic» أو «.microbe» أو «.c». السماح بـ «.hex»، شرط وجود ملف «.cod» مطابق له.
ka: "%1" სწორი PIC პროგრამა არაა. ფაილი უნდა არსებობდეს და მისი გაფართოება უნდა იყოს ".cod", ".asm", ".flowcode", ".basic", ".microbe", ან ".c" ".hex" დაშვებულია მაშინ, როცა არსებობს შესაბამისი ".cod" ფაილი.

source: (No program loaded)
ar: (لا برنامج حمّل)
ka: (პროგრამა ჩატვირთული არაა)

source: Scaling
ar: تحجيم
ka: მასშტაბირება

source: Linear
ar: خطّي
ka: ხაზოვანი

source: Logarithmic
ar: لوغارتميّ
ka: ლოგარითმული

source: Upper Absolute Value
ar: القيمة المطلقة العليا
ka: ზედა აბსოლუტური მნიშვნელობა

source: Lower Absolute Value
ar: القيمة المطلقة الدنيا
ka: ქვედა აბსოლუტური მნიშვნელობა

source: Voltage Probe
ar: مسبار الجهد
ka: ვოლტაჟის ზონდი

source: Current Probe
ar: مسبار التيار
ka: დენის ზონდი

source: Logic Probe
ar: مسبار المنطق
ka: ლოგიკური ზონდი

source: Push-to-Break
ar: اضغط للفصل
ka: გამთიშავი-ღილაკი

source: Push to Break
ar: اضغط للفصل
ka: გამთიშავი ღილაკი

source: Button Text
ar: نصّ الزر
ka: ღილაკის ტექსტი

source: Bounce
ar: ارتداد
ka: ხტუნვა

source: Bounce Period
ar: فترة الارتداد
ka: ასხლეტის პერიოდი

source: Push-to-Make
ar: اضغط للوصل
ka: ჩამრთველი-ღილაკი

source: Push to Make
ar: اضغط للوصل
ka: ჩამრთველი ღილაკი

source: RAM
ar: الذّاكرة العشوائيّة

source: Word Size
ar: حجم الكلمة
ka: სიტყვის ზომა

source: Resistor
ar: مقاوم كهربائي
ka: რეზისტორი

source: Resistor DIP
ar: مقاوم DIP
ka: რეზისტორის DIP

source: Count
ar: العدد
ka: რაოდენობა

source: Rotary
ar: دوار
ka: მბრუნავი

source: Number of Positions
ar: عدد المواضع
ka: პოზიციების რაოდენობა

source: Serial Port
ar: المنفذ التّسلسليّ
ka: სერიული პორტი

source: DPDT Toggle
ar: قلاب DPDT
ka: DPDT გადამრთველი

source: DPST Toggle
ar: قلاب DPST
ka: DPST გადამრთველი

source: SPDT Toggle
ar: قلاب SPDT
ka: SPDT გადამრთველი

source: SPST Toggle
ar: قلاب SPST
ka: SPST გადამრთველი

source: Variable Capacitor
ar: مكثف متغير
ka: ცვლადი კონდენსატორი

source: Max
ar: الأقصى
ka: მაქს

source: Min
ar: الأدنى
ka: მინ

source: Variable Resistor
ar: مقاوم متغير
ka: ცვლადი რეზისტორი

source: Voltage Regulator
ar: منظم الجهد
ka: ვოლტაჟის რეგულატორი

source: Voltage Out
ar: الجهد الخارج
ka: გამომავალი ვოლტაჟი

source: The cod file "%1" was not found.
ar: لم أجد ملف cod «%1».
ka: ვერ ვიპოვე cod-ის ფაილი "%1".

source: File Not Found
ar: الملف غير موجود
ka: ფაილი ვერ მოიძებნა

source: The processor for cod file "%1" is unrecognized.
ar: لم أتعرّف على المعالج لملف cod «%1».
ka: პროცესორი cod-ის ფაილისთვის "%1" უცნობია.

source: Unrecognized Processor
ar: معالج غير متعرّف عليه
ka: უცნობი პროცესორი

source: The file name "%1" is too long.
ar: اسم الملف "%1" طويل جداً.
ka: ფაილის სახელი "%1" ძალიან გრძელია.

source: Filename Too Long
ar: اسم الملف طويل جداً
ka: ფაილის სახელი ძალიან გრძელია

source: The lst file associated with the cod file "%1" was not found.
ar: لم أجد ملف lst المرتبط بملف cod «%1».
ka: cod ფაილთან "%1" ასოცირებული lst ფაილი აღმოჩენილი არაა.

source: LST File Not Found
ar: لم أجد ملف LST
ka: LST ფაილი აღმოჩენილი არაა

source: The cod file "%1" is bad.
ar: ملف cod «%1» سيئ.
ka: COD-ის ფაილი "%1" არასწორია.

source: Bad File
ar: ملف سيئ
ka: არასწორი ფაილი

source: The cod file "%1" could not be read from.
ar: لم أستطع القراءة من ملف cod «%1».
ka: cod-ის ფაილიდან "%1" წაკითხვა შეუძლებელია.

source: Unreadable File
ar: ملف غير قابل للقراءة
ka: წაუკითხვადი ფაილი

source: An error occurred with the cod file "%1".
ar: حدث خطأ مع ملف cod «%1».
ka: შეცდომა cod-ის ფაილში "%1".

source: Error
ar: خطأ
ka: შეცდომა

source: Generic
ar: عامّ
ka: ზოგადი

source: File
ar: ملف
ka: ფაილი

source: SFR
ar: سجل الوظائف الخاصة

source: Breakpoint
ar: نقطة التّوقّف
ka: გამართვის წერტილი

source: Invalid
ar: غير صالح
ka: არასწორი

source: Unknown
ar: مجهول
ka: უცნობი

source: Subcircuits
ar: الدوائر الفرعية
ka: ქვეწრედები

source: Microbe Code Output
ar: إخراج شفرة Microbe
ka: Microbe-ის კოდის გამოტანა

source: Assembly Code Output
ar: إخراج شفرة التجميع
ka: ასამბლერის კოდის გამოტანა

source: Hex Code Output
ar: إخراج الشفرة الستة عشرية
ka: თექვსმეტობითი კოდის გამოტანა

source: Hex Code
ar: شفرة سداسية عشرية
ka: თექვსმეტობითი კოდი

source: Convert to...
ar: حوّل إلى...
ka: გადაყვანა...

source: Convert To
ar: حول إلى
ka: გარდაქმნა

source: Assembly
ar: تجميع
ka: ასამბლერი

source: Hex
ar: ست
ka: თექვსმეტობითი

source: PIC (upload)
ar: PIC (رفع)
ka: PIC (ატვირთვა)

source: Construct a FlowCode document by dragging FlowParts from the list on the left. All FlowCharts require an initial "Start" part, of which there can only be one.<br><br>Some FlowParts, such as Subroutines, act as a container element for other FlowParts. Drag the items in or out of a container as appropriate. The container that will become the parent of the part being dragged is indicated by being selected.<br><br>Note that connections cannot be made between FlowParts in different containers, or at different levels.
ar: ابن وثيقة FlowCode بسحب أجزاء FlowParts من القائمة على اليسار. تتطلب كل المخططات الانسيابية جزء «بداية» مبدئياً، ولا أستطيع أن يكون إلا واحدًا. <br><br>تعمل بعض أجزاء FlowParts، كالإجراءات الفرعية، كعنصر حاوية لأجزاء FlowParts الأخرى. اسحب العناصر إلى داخل الحاوية أو خارجها حسب الاقتضاء. تشير الحاوية التي ستصبح الحاوية الأم للجزء المسحوب إلى أنه محدد. <br><br>لاحظ أنه لا أستطيع أن أصل بين أجزاء FlowParts في حاويات مختلفة، أو في مستويات مختلفة.
ka: ააშენეთ FlowCode დოკუმენტი მარცხნივ სიიდან FlowParts- ის გადატანით. ყველა FlowCharts მოითხოვს საწყის "დაწყებას" ნაწილს, რომელთაგან მხოლოდ ერთი შეიძლება იყოს.<br><br>ზოგიერთი FlowParts, როგორიცაა Subroutines, მოქმედებს როგორც კონტეინერის ელემენტი სხვა FlowParts. გადაიტანეთ ნივთები კონტეინერში ან მის გარეთ, საჭიროებისამებრ. კონტეინერი, რომელიც გახდება გადაყვანილი ნაწილის მშობელი, მითითებულია შერჩევით.<br><br>გაითვალისწინეთ, რომ კავშირები არ შეიძლება განხორციელდეს FlowParts– ს შორის სხვადასხვა კონტეინერებში, ან სხვადასხვა დონეზე.

source: Common
ar: شائع
ka: ჩვეულებრივი

source: Sub Call
ar: استدعاء فرعي
ka: ქვეგამოძახება

source: Subroutine
ar: دالة
ka: ქვეპროგრამები

source: Call %1
ar: نداء %1
ka: %1-ის გამოძახება

source: Functions
ar: الدوال
ka: ფუნქციები

source: Trigger
ar: المطلقات
ka: ტრიგერი

source: Count %1 for %2 sec
ar: اعدد %1 لـ %2 ث
ka: %1-ის დათვლა %2 წამით

source: Delay
ar: التأخير
ka: დაყოვნება

source: Pause Length
ar: طول الإيقاف المؤقت
ka: პაუზის ხანგრძლივობა

source: Delay for %1 sec
ar: أخّر لـ %1 ث
ka: %1 წამით დაყოვნება

source: Embed
ar: ضمّن
ka: ჩაშენება

source: Type
ar: النوع
ka: ტიპი

source: Code
ar: الشفرة
ka: კოდი

source: // Embedded code:
ar: // شفرة مضمنة:
ka: // ჩაშენებული კოდი:

source: End
ar: النهاية

source: Loops
ar: حلقات
ka: მარყუჟები

source: For
ar: لـ

source: For Loop
ar: حلقة تكرار
ka: For ციკლი

source: Variable
ar: متغير
ka: ცვლადი

source: Initial Value
ar: القيمة الأوّليّة
ka: საწყისი მნიშვნელობა

# for x = 1 to
source: to
ar: إلى
ka: სადამდე

source: End Value
ar: القيمة النهائية
ka: საბოლოო მნიშვნელობა

source: Step
ar: خطوة
ka: ნაბიჯი

source: InputButton
ar: زر الإدخال
ka: შეყვანის ღილაკი

source: Pin
ar: دبوس
ka: მიმაგრება

source: Continue on %1 %2
ar: تابع على %1 %2
ka: %1-ზე გაგრძელება %2

source: Interrupt
ar: مقاطعة
ka: წყვეტა

source: Interrupt %1
ar: مقاطعة %1
ka: %1-ის შეწყვეტა

source: Pin map
ar: خريطة الدبوس
ka: კონტაქტების რუკა

source: Read %1 to %2
ar: اقرأ %1 إلى %2
ka: წაკითხვა %1-დან %2-მდე

source: Pin Map Editor
ar: محرر خريطة الدبابيس
ka: კონტაქტების რუკის რედაქტორი

source: Pulse
ar: نبض
ka: პულსი

source: Duration
ar: المدّة
ka: ხანგრძლოვობა

source: Pulse %1 for %2 sec
ar: انبض %1 لـ %2 ث
ka: %1 იმპულსი %2 წამით

source: I\/O
ar: د\/خ

source: Read from Port
ar: اقرأ من المنفذ
ka: წაკთხვა პორტიდან

source: Read
ar: مقروءة
ka: წაკითხვა

# read from port to x
source: to
ar: إلى
ka: სადამდე

source: Repeat
ar: تكرار
ka: გამეორება

source: Operation
ar: العملية
ka: ოეპრაცია

source: Value
ar: القيمة
ka: მნიშვნელობა

source: repeat until %1 %2 %3
ar: كرِّر حتى %1 %2 %3
ka: გამეორება %1-მდე %2 %3

source: Set Pin State
ar: اضبط حالة الدبوس
ka: კონტაქტის მდგომარეობის დაყენება

source: State
ar: الحالة

source: Set %1 %2
ar: عيّن %1 %2
ka: %1-ის დაყენება %2

source: SevenSeg
ar: سبعة مقاطع
ka: შვიდსეგმენტიანი

source: Display %1 on %2
ar: اعرض %1 على %2
ka: %1-ის ჩვენება %2-ზე

source: Start
ar: ابدأ
ka: დაწყება

source: Sub
ar: فرعي
ka: ქვეპროგრამა

source: Test Pin State
ar: اختبر حالة الدبوس
ka: კონტაქტის მდგომარეობის შემოწმება

source: Variables
ar: المتغيّرات
ka: ცვლადები

source: Unary
ar: أحادي
ka: უნარული

source: Rotate Left
ar: دوّر لليسار
ka: მარცხნივ შებრუნება

source: Rotate Right
ar: دوّر لليمين
ka: მარჯვნივ შებრუნება

source: Increment
ar: الزيادة
ka: გაზრდა

source: Decrement
ar: إنقاص
ka: შემცირება

source: Assignment
ar: تعيين
ka: მინიჭება

source: Variable Assignment
ar: إسناد متغير
ka: ცვლადის მინიჭება

source: Comparison
ar: المقارنة
ka: შედარება

source: Variable Comparison
ar: مقارنة متغير
ka: ცვალდების შედარება

source: While
ar: بينما
ka: სანამ

source: while %1 %2 %3
ar: بينما %1 %2 %3
ka: სანამ %1 %2 %3

source: Write to Port
ar: اكتب إلى المنفذ
ka: პორტში ჩაწერა

source: Write
ar: الكتابة
ka: ჩასწორება

# write to port
source: to
ar: إلى
ka: სადამდე

source: Write %1 to %2
ar: اكتب %1 إلى %2
ka: ჩაწერა %1-დან %2-მდე

source: The values control the indentation from the left margin of the various types of assembly code.
ar: تتحكم القيم في الإزاحة عن الهامش الأيسر لأنواع شفرة التجميع المختلفة.
ka: მნიშვნელობები მართავენ შეწევას მარცხენა მინდვრიდან ასამბლერის კოდის სხვადასხვა ტიპებისთვის.

source: Output Code Indentation
ar: إزاحة شفرة الإخراج
ka: გამოტანილი კოდის შეწევა

source: 'equ' Value
ar: قيمة 'equ'
ka: 'equ'-ის მნიშვნელობა

source: Instruction Data
ar: بيانات التعليمات
ka: ინსტრუქციის მონაცემები

source: Comment
ar: تعليق
ka: კომენტარი

source: Instruction Name
ar: اسم التعليمات
ka: ინსტრუქციის სახელი

source: &Automatically format Microbe output
ar: &نَسِّقْ خرج الميكروب آلي
ka: Microbe-ის გამოტანის &ავტომატური დაფორმატება

source: Provides context-sensitive help relevant to the current editing being performed.
ar: وفّر تعليمات حساسة للسياق وذات صلة بالتحرير الحالي الذي قمت به.
ka: მოგაწვდით ამჟამად მიმდინარე ჩასწორების კონტექსტის შესაბამის დახმარებას.

source: No Item Selected
ar: لم يحدد أي عنصر
ka: არაფერი მოგინიშნავთ

source: Multiple Items
ar: عناصر متعددة
ka: ერთზე მეტი ელემენტი

source: Reset
ar: صفّر
ka: განულება

source: Reset item help to last saved changes?
ar: أعد ضبط تعليمات العنصر إلى آخر التغييرات المحفوظة؟
ka: ჩამოვყარო ელემენტის დახმარება ბოლოს შენახულ ცვლილებებზე?

source: Cannot save item description.
ar: لم أستطع حفظ وصف العنصر.
ka: ელემენტის აღწერის შენახვის შეცდომა.

source: Edit
ar: حرّر
ka: რედაქტირება

source: Context Help Directory
ar: دليل تعليمات السياق
ka: კონტექსტური დახმარების საქაღალდე

source: S&ave
ar: ا&حفظ
ka: შენა&ხვა

source: Subproject Details
ar: تفاصيل المشروع الفرعي
ka: ქვეპროექტის დეტალები

source: Target File:
ar: ملف الهدف:
ka: სამიზნე ფაილი:

source: Type:
ar: النوع:
ka: ტიპი:

source: Library
ar: المكتبة
ka: ბიბლიოთეკა

source: Reuse the same output view for code generation
ar: أعِد استخدام عرض المخرجات ذاته لتوليد الشيفرة
ka: იგივე გამოტანის ხედის გამოყენება კოდის გენერაციისთვის

source: The grid color in the work area.
ar: لون الشبكة في مساحة العمل.
ka: ბადის ფერი სამუშაო სივრცეში.

source: Grid Colour
ar: لون الشبكة
ka: ბადის ფერი

source: Show &grid:
ar: أ&ظهر الشبكة:
ka: &ბადის ჩვენება:

source: Maximum undo steps for work area. This does not apply to text documents - that is configurable separately under Configure Editor.
ar: الحد الأقصى لخطوات التراجع عن مساحة العمل. لا يسري هذا على الوثائق النصية - بل اضبطه على حدة ضمن اضبط المحرّر.
ka: მაქსიმალური გაუქმების ნაბიჯები სამუშაო ადგილისთვის. ეს არ ეხება ტექსტურ დოკუმენტს - მისი მორგება ცალკე, რედაქტორის მორგების ფანჯარაში ხდება.

source: Maximum undo steps for work area:
ar: الحد الأقصى لخطوات التراجع عن مساحة العمل:
ka: დაბრუნების ბიჯების რაოდენობა სამუშაო ადგილისთვის:

source: Show voltage bars &on electronic components
ar: اعرض أشرطة الجهد &على المكونات الإلكترونية
ka: ძაბვის ზ&ოლების ჩვენება ელექტრონულ კომპონენტებზე

source: Color the wires to match the voltage
ar: لوّن الأسلاك لمطابقة الجهد
ka: სადენების გაფერადება ძაბვასთან შესაბამისად

source: Animate wires to show the current or power flow
ar: حرّك الأسلاك لعرض تدفق التيار أو الطاقة
ka: სადენების ანიმაცია ძაბვის ან დენის დინების საჩვენებლად

source: Display Refresh Rate
ar: معدل تحديث العرض
ka: ეკრანის განახლების სიხშირე

source: Refresh rate:
ar: معدّل التّحديث:
ka: განახლების სიხშირე:

source: Medium (50 FPS)
ar: متوسط (50 إطارًا في الثانية)
ka: საშუალო (50 კადრ/წმ)

source: This is the number of times per second that the work area view is updated; a compromise between CPU usage and smoothness of display.
ar: هذا هو عدد المرات في الثانية التي يحدث فيها تحديث عرض مساحة العمل؛ وهو حل وسط بين استخدام وحدة المعالجة المركزية وسلاسة العرض.
ka: ეს რიცხვია, რამდენჯერაც წამში სამუშაო სივრცის განახლება ხდება. კომპრომისი CPU-ის გამოყენებასა და ჩვენების სიგლუვეს შორის.

source: Convenience
ar: وسائل الراحة
ka: საპირფარეშო

source: Restore opened doc&uments on startup
ar: أعِد فتح الوثا&ئق المفتوحة عند بدء التشغيل
ka: გახსნილი დოკ&უმენტების აღდენა გაშვებისას

source: Raise the &appropriate item selector on creating a new document
ar: ارفع محدّد العناصر &المناسب عند إنشاء وثيقة جديدة
ka: შესაბამისი ელემენტის &ამრჩევის ჩვენება ახალი დოკუმენტის შექმნისას

source: Raise the &Messages log when compiling
ar: ارفع سجل &الرسائل عند التصريف
ka: შეტყობინებების ჟურნალის ჩვენება კო&მპილაციისას

source: Radix (-r):
ar: الأساس (-r):
ka: ფესვი (-r):

source: Warning level (-w):
ar: مستوى التحذير (-w):
ka: გაფრთხილების დონე (-w):

source: Hex Format (-a):
ar: تنسيق سداسي عشري (-a):
ka: თექვსმეტობითი ფორმატი (-a):

source: All user defined symbols and macros are case sensitive. This option makes them case insensitive.
ar: جميع الرموز والماكروات المعرَّفة من المستخدم حساسة لحالة الأحرف. هذا الخيار يجعلها غير حساسة لحالة الأحرف.
ka: ყველა მომხმარებლის აღწერილი სიმბოლო და მაკრო რეგისტრზე დამოკიდებულია. ეს პარამეტრი ამას აუქმებს.

source: Ign&ore case (-i)
ar: تجاوز حالة الأحرف (-i)
ka: რეგი&სტრის იგნორი (-i)

source: By default, gpasm generates hex files using ISO format. However, some device programmers required a DOS formatted file. This option will cause gpasm to generate a DOS formatted hex file.
ar: مبدئياً، يولّد gpasm ملفات سداسية عشرية باستخدام تنسيق ISO. ومع ذلك، يطلب بعض مبرمجي الأجهزة ملفاً بتنسيق DOS. هذا الخيار يجعل gpasm يولّد ملفاً سداسياً عشرياً بتنسيق DOS.
ka: ნაგულისხმევად gpasm .hex ფაილებს ISO ფორმატში აგენერირებს.მაგრამ ზოგიერთი მოწყობილობის პროგრამატორს DOS-ით დაფორმატებული ფაილი სჭირდება. ეს პარამეტრი აიძულებს gpasm-ს, DOS-ის ფორმატის მქონე hex ფაილი შექმნას.

source: Generate DOS-formatted hex file (-&n)
ar: ولّد ملف سداسي عشري بتنسيق DOS (-&n)
ka: DOS-ის ფორმატის მქონე თექვსმეტობითი ფაილის გენერაცია (-&n)

source: GPASM supports inhx8m, inhx8s, inhx16, and inhx32 hex file formats. This option controls which hex file format is used.
ar: يدعم GPASM تنسيقات ملفات سداسية عشرية inhx8m و inhx8s و inhx16 و inhx32. يتحكم هذا الخيار في تنسيق الملف السداسي العشري المستخدَم.
ka: GPASM-ს აქვს inhx8m, inhx8s, inhx16 და inhx32 hex ფაილის ფორმატების მხარდაჭერა. ეს პარამეტრი აკონტროლებს, რომელი ფაილის ფორმატი გამოიყენება.

source: Decimal
ar: عشري
ka: ათობითი

source: Binary
ar: ثنائي
ka: ბინარული

source: Octal
ar: ثماني
ka: რვაობითი

source: Hexadecimal
ar: ست عشري
ka: თექვსმეტობითი

source: This sets the threshold of messages displayed in the log view.<ul><li>"All" will display all output - information, warnings and errors.<li>"Warnings" will suppress messages. <li>"Errors" will suppress both messages and warnings.</ul>
ar: يضبط هذا عتبة الرسائل المعروضة في عرض السجل.<ul><li>«الكل» سيعرض كل الإخراج - معلومات وتحذيرات وأخطاء.<li>«تحذيرات» سيوقف الرسائل. <li>«أخطاء» سيوقف كل من الرسائل والتحذيرات.</ul>
ka: ეს ადგენს ჟურნალის ხედში ნაჩვენები შეტყობინებების ზღურბლს.<ul><li>"ყველა" აჩვენებს ყველა გამოსავალს - ინფორმაციას, გაფრთხილებებს და შეცდომებს.<li>"გაფრთხილებები" ჩაახშობს შეტყობინებებს. <li>"შეცდომები" ჩაახშობს როგორც შეტყობინებებს, ასევე გაფრთხილებებს.</li></li></li></ul>

source: All
ar: الكلّ
ka: ყველა

source: Warnings
ar: التّحذيرات
ka: გაფრთხილებები

source: Errors
ar: الأخطاء
ka: შეცდომა

source: Other options:
ar: خيارات أخرى:
ka: სხვა პარამეტრები:

source: Link with shared libraries (&use this with new SDCC)
ar: اربط بالمكتبات المشتركة (&استخدم هذا مع SDCC الجديد)
ka: დაკავშირება გაზიარებულ ბიბლიოთეკებთან (გამოიყენეთ ეს &ახალი SDCC-სთვის)

source: Export As Image
ar: صدِّر كصورة
ka: გამოსახულების სახით გატანა

source: Format:
ar: النّسق:
ka: ფორმატი:

source: File name:
ar: اسم الملفّ:
ka: ფაილის სახელი:

source: Crop image:
ar: اقتصاص الصّورة:
ka: გამოსახულების ამოჭრა:

source: Export
ar: صدّر
ka: გატანა
